hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/*
 * Copyright (c) 2021-2022 hpmicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_ENET_H
#define HPM_ENET_H

typedef struct {
    __RW uint32_t MACCFG;                      /* 0x0: MAC Configuration Register */
    __RW uint32_t MACFF;                       /* 0x4: MAC Frame Filter */
    __RW uint32_t HASH_H;                      /* 0x8: Hash Table High Register */
    __RW uint32_t HASH_L;                      /* 0xC: Hash Table Low Register */
    __RW uint32_t GMII_ADDR;                   /* 0x10: GMII Address Register */
    __RW uint32_t GMII_DATA;                   /* 0x14: GMII Data Register */
    __RW uint32_t FLOWCTRL;                    /* 0x18: Flow Control Register */
    __RW uint32_t VLAN_TAG;                    /* 0x1C: VLAN Tag Register */
    __R  uint32_t VERSION;                     /* 0x20: Version Register */
    __R  uint32_t DEBUGGING;                   /* 0x24: Debug Register */
    __RW uint32_t RWKFRMFILT;                  /* 0x28: Remote Wake-Up Frame Filter Register */
    __RW uint32_t PMT_CSR;                     /* 0x2C: PMT Control and Status Register */
    __RW uint32_t LPI_CSR;                     /* 0x30: LPI Control and Status Regsiter */
    __RW uint32_t LPI_TCR;                     /* 0x34: LPI Timers Control Register */
    __R  uint32_t INTR_STATUS;                 /* 0x38: Interrupt Status Register */
    __RW uint32_t INTR_MASK;                   /* 0x3C: Interrupt Mask Register */
    __RW uint32_t MAC_ADDR_0_HIGH;             /* 0x40: MAC Address 0 High Register */
    __RW uint32_t MAC_ADDR_0_LOW;              /* 0x44: MAC Address 0 Low Register */
    struct {
        __RW uint32_t HIGH;                    /* 0x48: MAC Address High Register */
        __RW uint32_t LOW;                     /* 0x4C: MAC Address Low Register */
    } MAC_ADDR[4];
    __R  uint8_t  RESERVED0[112];              /* 0x68 - 0xD7: Reserved */
    __RW uint32_t XMII_CSR;                    /* 0xD8: SGMII/RGMII/SMII Control and Status Register */
    __RW uint32_t WDOG_WTO;                    /* 0xDC: Watchdog Timeout Register */
    __RW uint32_t GPIO;                        /* 0xE0: General Purpose IO Register */
    __R  uint8_t  RESERVED1[28];               /* 0xE4 - 0xFF: Reserved */
    __RW uint32_t MMC_CNTRL;                   /* 0x100: MMC Control establishes the operating mode of MMC. */
    __RW uint32_t MMC_INTR_RX;                 /* 0x104: MMC Receive Interrupt maintains the interrupt generated from all
of the receive statistic counters. */
    __RW uint32_t MMC_INTR_TX;                 /* 0x108: MMC Transmit Interrupt maintains the interrupt generated from all
of the transmit statistic counters */
    __RW uint32_t MMC_INTR_MASK_RX;            /* 0x10C: MMC Receive Interrupt mask maintains the mask for the interrupt
generated from all of the receive statistic counters */
    __RW uint32_t MMC_INTR_MASK_TX;            /* 0x110: MMC Transmit Interrupt Mask */
    __RW uint32_t TXOCTETCOUNT_GB;             /* 0x114: Number of bytes transmitted, exclusive of preamble and retried
bytes, in good and bad frames. */
    __RW uint32_t TXFRAMECOUNT_GB;             /* 0x118: Number of good and bad frames transmitted, exclusive of retried
frames. */
    __RW uint32_t TXBROADCASTFRAMES_G;         /* 0x11C: Number of good broadcast frames transmitted */
    __RW uint32_t TXMLTICASTFRAMES_G;          /* 0x120: Number of good multicast frames transmitted */
    __RW uint32_t TX64OCTETS_GB;               /* 0x124: Number of good and bad frames transmitted with length 64 bytes,
exclusive of preamble and retried frames. */
    __RW uint32_t TX65TO127OCTETS_GB;          /* 0x128: Number of good and bad frames transmitted with length between
65 and 127 (inclusive) bytes, exclusive of preamble and retried
frames. */
    __RW uint32_t TX128TO255OCTETS_GB;         /* 0x12C: Number of good and bad frames transmitted with length between
128 and 255 (inclusive) bytes, exclusive of preamble and retried
frames. */
    __RW uint32_t TX256TO511OCTETS_GB;         /* 0x130: Number of good and bad frames transmitted with length between
256 and 511 (inclusive) bytes, exclusive of preamble and retried
frames. */
    __RW uint32_t TX512TO1023OCTETS_GB;        /* 0x134: Number of good and bad frames transmitted with length between
512 and 1,023 (inclusive) bytes, exclusive of preamble and retried
frames. */
    __RW uint32_t TX1024TOMAXOCTETS_GB;        /* 0x138: Number of good and bad frames transmitted with length between
1,024 and maxsize (inclusive) bytes, exclusive of preamble and
retried frames. */
    __RW uint32_t TXUNICASTFRAMES_GB;          /* 0x13C: Number of good and bad unicast frames transmitted. */
    __RW uint32_t TXMULTICASTFRAMES_GB;        /* 0x140: Number of good and bad multicast frames transmitted. */
    __RW uint32_t TXBROADCASTFRAMES_GB;        /* 0x144: Number of good and bad broadcast frames transmitted. */
    __RW uint32_t TXUNDERFLOWERROR;            /* 0x148: Number of frames aborted because of frame underflow error. */
    __RW uint32_t TXSINGLECOL_G;               /* 0x14C: Number of successfully transmitted frames after a single collision
in the half-duplex mode. */
    __RW uint32_t TXMULTICOL_G;                /* 0x150: Number of successfully transmitted frames after multiple collisions
in the half-duplex mode. */
    __RW uint32_t TXDEFERRED;                  /* 0x154: Number of successfully transmitted frames after a deferral in the
half-duplex mode. */
    __RW uint32_t TXLATECOL;                   /* 0x158: Number of frames aborted because of late collision error */
    __RW uint32_t TXEXESSCOL;                  /* 0x15C: Number of frames aborted because of excessive (16) collision
errors */
    __RW uint32_t TXCARRIERERROR;              /* 0x160: Number of frames aborted because of carrier sense error (no
carrier or loss of carrier). */
    __RW uint32_t TXOCTETCOUNT_G;              /* 0x164: Number of bytes transmitted, exclusive of preamble, only in good
frames. */
    __RW uint32_t TXFRAMECOUNT_G;              /* 0x168: Number of good frames transmitted */
    __RW uint32_t TXEXCESSDEF;                 /* 0x16C: Number of frames aborted because of excessive deferral error
(deferred for more than two max-sized frame times). */
    __RW uint32_t TXPAUSEFRAMES;               /* 0x170: Number of good Pause frames transmitted */
    __RW uint32_t TXVLANFRAMES_G;              /* 0x174: Number of good VLAN frames transmitted, exclusive of retried
frames. */
    __RW uint32_t TXOVERSIZE_G;                /* 0x178: Number of frames transmitted without errors and with length
greater than the maxsize (1,518 or 1,522 bytes for VLAN tagged
frames; 2000 bytes if enabled in Bit 27 of Register 0 (MAC
Configuration Register)). */
    __R  uint8_t  RESERVED2[4];                /* 0x17C - 0x17F: Reserved */
    __RW uint32_t RXFRAMECOUNT_GB;             /* 0x180: Number of good and bad frames received */
    __RW uint32_t RXOCTETCOUNT_G;              /* 0x184: Number of bytes received, exclusive of preamble, only in good
frames. */
    __RW uint32_t RXOCTETCOUNT_GB;             /* 0x188: Number of bytes received, exclusive of preamble, in good and bad
frames. */
    __RW uint32_t RXBROADCASTFRAMES_G;         /* 0x18C: Number of good broadcast frames received */
    __RW uint32_t RXMULTICASTFRAMES_G;         /* 0x190: Number of good multicast frames received */
    __RW uint32_t RXCRCERROR;                  /* 0x194: Number of frames received with CRC error */
    __RW uint32_t RXALIGNMENTERROR;            /* 0x198: Number of frames received with alignment (dribble) error. Valid
only in 10/100 mode */
    __RW uint32_t RXRUNTERROR;                 /* 0x19C: Number of frames received with runt (<64 bytes and CRC error)
error. */
    __RW uint32_t RXJABBERERROR;               /* 0x1A0: Number of giant frames received with length (including CRC)
greater than 1,518 bytes (1,522 bytes for VLAN tagged) and with
CRC error. If Jumbo Frame mode is enabled, then frames of
length greater than 9,018 bytes (9,022 for VLAN tagged) are
considered as giant frames. */
    __RW uint32_t RXUNDERSIZE_G;               /* 0x1A4: Number of frames received with length less than 64 bytes, without
any errors. */
    __RW uint32_t RXOVERSIZE_G;                /* 0x1A8: Number of frames received without errors, with length greater
than the maxsize (1,518 or 1,522 for VLAN tagged frames; 2,000
bytes if enabled in Bit 27 of Register 0 (MAC Configuration
Register)) */
    __RW uint32_t RX64OCTETS_GB;               /* 0x1AC: Number of good and bad frames received with length 64 bytes,
exclusive of preamble. */
    __RW uint32_t RX65TO127OCTETS_GB;          /* 0x1B0:  */
    __RW uint32_t RX128TO255OCTETS_GB;         /* 0x1B4:  */
    __RW uint32_t RX256TO511OCTETS_GB;         /* 0x1B8: Number of good and bad frames received with length between
256 and 511 (inclusive) bytes, exclusive of preamble. */
    __RW uint32_t RX512TO1023OCTETS_GB;        /* 0x1BC: Number of good and bad frames received with length between
512 and 1023 (inclusive) bytes, exclusive of preamble. */
    __RW uint32_t RX1024TOMAXOCTETS_GB;        /* 0x1C0: Number of good and bad frames received with length between
1024 and maxsize (inclusive) bytes, exclusive of preamble. */
    __RW uint32_t RXUNICASTFRAMES_G;           /* 0x1C4: Number of received good unicast frames. */
    __RW uint32_t RXLENGTHERROR;               /* 0x1C8: Number of frames received with length error (Length type field ≠
frame size), for all frames with valid length field. */
    __RW uint32_t RXOUTOFRANGETYPE;            /* 0x1CC: Number of frames received with length field not equal to the valid
frame size (greater than 1,500 but less than 1,536). */
    __RW uint32_t RXPAUSEFRAMES;               /* 0x1D0: Number of good and valid Pause frames received. */
    __RW uint32_t RXFIFOOVERFLOW;              /* 0x1D4: Number of missed received frames because of FIFO overflow.
This counter is not present in the GMAC-CORE configuration. */
    __RW uint32_t RXVLANFRAMES_GB;             /* 0x1D8: Number of good and bad VLAN frames received. */
    __RW uint32_t RXWATCHDOGERROR;             /* 0x1DC: Number of frames received with error because of watchdog
timeout error (frames with a data load larger than 2,048 bytes or
the value programmed in Register 55 (Watchdog Timeout
Register)). */
    __RW uint32_t RXRCVERROR;                  /* 0x1E0: Number of frames received with Receive error or Frame Extension
error on the GMII or MII interface. */
    __RW uint32_t RXCTRLFRAMES_G;              /* 0x1E4: Number of received good control frames */
    __R  uint8_t  RESERVED3[24];               /* 0x1E8 - 0x1FF: Reserved */
    __RW uint32_t MMC_IPC_INTR_MASK_RX;        /* 0x200: MMC IPC Receive Checksum Offload Interrupt Mask maintains
the mask for the interrupt generated from the receive IPC statistic
counters. */
    __R  uint8_t  RESERVED4[4];                /* 0x204 - 0x207: Reserved */
    __RW uint32_t MMC_IPC_INTR_RX;             /* 0x208: MMC Receive Checksum Offload Interrupt maintains the interrupt
that the receive IPC statistic counters generate. See Table 4-25
for further detail. */
    __R  uint8_t  RESERVED5[4];                /* 0x20C - 0x20F: Reserved */
    __RW uint32_t RXIPV4_GD_FMS;               /* 0x210: Number of good IPv4 datagrams received with the TCP, UDP, or
ICMP payload */
    __RW uint32_t RXIPV4_HDRERR_FRMS;          /* 0x214: Number of IPv4 datagrams received with header (checksum,
length, or version mismatch) errors */
    __RW uint32_t RXIPV4_NOPAY_FRMS;           /* 0x218: Number of IPv4 datagram frames received that did not have a
TCP, UDP, or ICMP payload processed by the Checksum engine */
    __RW uint32_t RXIPV4_FRAG_FRMS;            /* 0x21C: Number of good IPv4 datagrams with fragmentation */
    __RW uint32_t RXIPV4_UDSBL_FRMS;           /* 0x220: Number of good IPv4 datagrams received that had a UDP
payload with checksum disabled */
    __RW uint32_t RXIPV6_GD_FRMS;              /* 0x224: Number of good IPv6 datagrams received with TCP, UDP, or
ICMP payloads */
    __RW uint32_t RXIPV6_HDRERR_FRMS;          /* 0x228: Number of IPv6 datagrams received with header errors (length or
version mismatch) */
    __RW uint32_t RXIPV6_NOPAY_FRMS;           /* 0x22C: Number of IPv6 datagram frames received that did not have a
TCP, UDP, or ICMP payload. This includes all IPv6 datagrams with
fragmentation or security extension headers */
    __RW uint32_t RXUDP_GD_FRMS;               /* 0x230: Number of good IP datagrams with a good UDP payload. This
counter is not updated when the rxipv4_udsbl_frms counter is
incremented. */
    __RW uint32_t RXUDP_ERR_FRMS;              /* 0x234: Number of good IP datagrams whose UDP payload has a
checksum error */
    __RW uint32_t RXTCP_GD_FRMS;               /* 0x238: Number of good IP datagrams with a good TCP payload */
    __RW uint32_t RXTCP_ERR_FRMS;              /* 0x23C: Number of good IP datagrams whose TCP payload has a
checksum error */
    __RW uint32_t RXICMP_GD_FRMS;              /* 0x240: Number of good IP datagrams with a good ICMP payload */
    __RW uint32_t RXICMP_ERR_FRMS;             /* 0x244: Number of good IP datagrams whose ICMP payload has a
checksum error */
    __R  uint8_t  RESERVED6[8];                /* 0x248 - 0x24F: Reserved */
    __RW uint32_t RXIPV4_GD_OCTETS;            /* 0x250: Number of bytes received in good IPv4 datagrams encapsulating
TCP, UDP, or ICMP data. (Ethernet header, FCS, pad, or IP pad
bytes are not included in this counter or in the octet counters listed
below). */
    __RW uint32_t RXIPV4_HDRERR_OCTETS;        /* 0x254: Number of bytes received in IPv4 datagrams with header errors
(checksum, length, version mismatch). The value in the Length
field of IPv4 header is used to update this counter. */
    __RW uint32_t RXIPV4_NOPAY_OCTETS;         /* 0x258: Number of bytes received in IPv4 datagrams that did not have a
TCP, UDP, or ICMP payload. The value in the IPv4 header’s
Length field is used to update this counter. */
    __RW uint32_t RXIPV4_FRAG_OCTETS;          /* 0x25C: Number of bytes received in fragmented IPv4 datagrams. The
value in the IPv4 header’s Length field is used to update this
counter */
    __RW uint32_t RXIPV4_UDSBL_OCTETS;         /* 0x260: Number of bytes received in a UDP segment that had the UDP
checksum disabled. This counter does not count IP Header bytes. */
    __RW uint32_t RXIPV6_GD_OCTETS;            /* 0x264: Number of bytes received in good IPv6 datagrams encapsulating
TCP, UDP or ICMPv6 data */
    __RW uint32_t RXIPV6_HDRERR_OCTETS;        /* 0x268: Number of bytes received in IPv6 datagrams with header errors
(length, version mismatch). The value in the IPv6 header’s Length
field is used to update this counter. */
    __RW uint32_t RXIPV6_NOPAY_OCTETS;         /* 0x26C: Number of bytes received in IPv6 datagrams that did not have a
TCP, UDP, or ICMP payload. The value in the IPv6 header’s
Length field is used to update this counter. */
    __RW uint32_t RXUDP_GD_OCTETS;             /* 0x270: Number of bytes received in a good UDP segment. This counter
(and the counters below) does not count IP header bytes. */
    __RW uint32_t RXUDP_ERR_OCTETS;            /* 0x274: Number of bytes received in a UDP segment that had checksum
errors */
    __RW uint32_t RXTCP_GD_OCTETS;             /* 0x278: Number of bytes received in a good TCP segment */
    __RW uint32_t RXTCP_ERR_OCTETS;            /* 0x27C: Number of bytes received in a TCP segment with checksum
errors */
    __RW uint32_t RXICMP_GD_OCTETS;            /* 0x280: Number of bytes received in a good ICMP segment */
    __R  uint8_t  RESERVED7[380];              /* 0x284 - 0x3FF: Reserved */
    struct {
        __RW uint32_t L3_L4_CTRL;              /* 0x400: Layer 3 and Layer 4 Control Register */
        __RW uint32_t L4_ADDR;                 /* 0x404: Layer 4 Address Register */
        __R  uint8_t  RESERVED0[8];            /* 0x408 - 0x40F: Reserved */
        __RW uint32_t L3_ADDR_0;               /* 0x410: Layer 3 Address 0 Register */
        __RW uint32_t L3_ADDR_1;               /* 0x414: Layer 3 Address 1 Register */
        __RW uint32_t L3_ADDR_2;               /* 0x418: Layer 3 Address 2 Register */
        __RW uint32_t L3_ADDR_3;               /* 0x41C: Layer 3 Address 3 Register */
        __R  uint8_t  RESERVED1[16];           /* 0x420 - 0x42F: Reserved */
    } L3_L4_CFG[4];
    __R  uint8_t  RESERVED8[64];               /* 0x4C0 - 0x4FF: Reserved */
    __RW uint32_t HASH_TABLE[8];               /* 0x500 - 0x51C: Hash Table Register 0 */
    __R  uint8_t  RESERVED9[100];              /* 0x520 - 0x583: Reserved */
    __RW uint32_t VLAN_TAG_INC_RPL;            /* 0x584: VLAN Tag Inclusion or Replacement Register */
    __RW uint32_t VLAN_HASH;                   /* 0x588: VLAN Hash Table Register */
    __R  uint8_t  RESERVED10[372];             /* 0x58C - 0x6FF: Reserved */
    __RW uint32_t TS_CTRL;                     /* 0x700: Timestamp Control Register */
    __RW uint32_t SUB_SEC_INCR;                /* 0x704: Sub-Second Increment Register */
    __RW uint32_t SYST_SEC;                    /* 0x708: System Time - Seconds Register */
    __RW uint32_t SYST_NSEC;                   /* 0x70C: System Time - Nanoseconds Register */
    __RW uint32_t SYST_SEC_UPD;                /* 0x710: System Time - Seconds Update Register */
    __RW uint32_t SYST_NSEC_UPD;               /* 0x714: System Time - Nanoseconds Update Register */
    __RW uint32_t TS_ADDEND;                   /* 0x718: Timestamp Addend Register */
    __RW uint32_t TGTTM_SEC;                   /* 0x71C: Target Time Seconds Register */
    __RW uint32_t TGTTM_NSEC;                  /* 0x720: Target Time Nanoseconds Register */
    __RW uint32_t SYSTM_H_SEC;                 /* 0x724: System Time - Higher Word Seconds Register */
    __R  uint32_t TS_STATUS;                   /* 0x728: Timestamp Status Register */
    __RW uint32_t PPS_CTRL;                    /* 0x72C: PPS Control Register */
    __RW uint32_t AUX_TS_NSEC;                 /* 0x730: Auxiliary Timestamp - Nanoseconds Register */
    __RW uint32_t AUX_TS_SEC;                  /* 0x734: Auxiliary Timestamp - Seconds Register */
    __R  uint8_t  RESERVED11[40];              /* 0x738 - 0x75F: Reserved */
    __RW uint32_t PPS0_INTERVAL;               /* 0x760: PPS0 Interval Register */
    __RW uint32_t PPS0_WIDTH;                  /* 0x764: PPS0 Width Register */
    __R  uint8_t  RESERVED12[24];              /* 0x768 - 0x77F: Reserved */
    struct {
        __RW uint32_t TGTTM_SEC;               /* 0x780: PPS Target Time Seconds Register */
        __RW uint32_t TGTTM_NSEC;              /* 0x784: PPS Target Time Nanoseconds Register */
        __RW uint32_t INTERVAL;                /* 0x788: PPS Interval Register */
        __RW uint32_t WIDTH;                   /* 0x78C: PPS Width Register */
        __R  uint8_t  RESERVED0[16];           /* 0x790 - 0x79F: Reserved */
    } PPS[3];
    __R  uint8_t  RESERVED13[2080];            /* 0x7E0 - 0xFFF: Reserved */
    __RW uint32_t DMA_BUS_MODE;                /* 0x1000: Bus Mode Register */
    __RW uint32_t DMA_TX_POLL_DEMAND;          /* 0x1004: Transmit Poll Demand Register */
    __RW uint32_t DMA_RX_POLL_DEMAND;          /* 0x1008: Receive Poll Demand Register */
    __RW uint32_t DMA_RX_DESC_LIST_ADDR;       /* 0x100C: Receive Descriptor List Address Register */
    __RW uint32_t DMA_TX_DESC_LIST_ADDR;       /* 0x1010: Transmit Descriptor List Address Register */
    __RW uint32_t DMA_STATUS;                  /* 0x1014: Status Register */
    __RW uint32_t DMA_OP_MODE;                 /* 0x1018: Operation Mode Register */
    __RW uint32_t DMA_INTR_EN;                 /* 0x101C: Interrupt Enable Register */
    __RW uint32_t DMA_MISS_OVF_CNT;            /* 0x1020: Missed Frame And Buffer Overflow Counter Register */
    __RW uint32_t DMA_RX_INTR_WDOG;            /* 0x1024: Receive Interrupt Watchdog Timer Register */
    __RW uint32_t DMA_AXI_MODE;                /* 0x1028: AXI Bus Mode Register */
    __RW uint32_t DMA_BUS_STATUS;              /* 0x102C: AHB or AXI Status Register */
    __R  uint8_t  RESERVED14[24];              /* 0x1030 - 0x1047: Reserved */
    __RW uint32_t DMA_CURR_HOST_TX_DESC;       /* 0x1048: Current Host Transmit Descriptor Register */
    __RW uint32_t DMA_CURR_HOST_RX_DESC;       /* 0x104C: Current Host Receive Descriptor Register */
    __RW uint32_t DMA_CURR_HOST_TX_BUF;        /* 0x1050: Current Host Transmit Buffer Address Register */
    __RW uint32_t DMA_CURR_HOST_RX_BUF;        /* 0x1054: Current Host Receive Buffer Address Register */
    __RW uint32_t DMA_HW_FEATURE;              /* 0x1058: HW Feature Register */
} ENET_Type;


/* Bitfield definition for register: MACCFG */
/*
 * SARC (RW)
 *
 * Source Address Insertion or Replacement Control
 *  This field controls the source address insertion or replacement for all transmitted frames. Bit 30 specifies which MAC Address register (0 or 1) is used for source address insertion or replacement based on the values of Bits [29:28]:
 * - 2'b0x: The input signals mti_sa_ctrl_i and ati_sa_ctrl_i control the SA field generation.
 * - 2'b10: - If Bit 30 is set to 0, the MAC inserts the content of the MAC Address 0 registers (registers 16 and 17) in the SA field of all transmitted frames. - If Bit 30 is set to 1 and the Enable MAC Address Register 1 option is selected during core configuration, the MAC inserts the content of the MAC Address 1 registers (registers 18 and 19) in the SA field of all transmitted frames.
 * - 2'b11: - If Bit 30 is set to 0, the MAC replaces the content of the MAC Address 0 registers (registers 16 and 17) in the SA field of all transmitted frames. - If Bit 30 is set to 1 and the Enable MAC Address Register 1 option is selected during core configuration, the MAC replaces the content of the MAC Address 1 registers (registers 18 and 19) in the SA field of all transmitted frames. Note: - Changes to this field take effect only on the start of a frame. If you write this register field when a frame is being transmitted, only the subsequent frame can use the updated value, that is, the current frame does not use the updated value. - These bits are reserved and RO when the Enable SA, VLAN, and CRC Insertion on TX feature is not selected during core configuration.
 */
#define ENET_MACCFG_SARC_MASK (0x70000000UL)
#define ENET_MACCFG_SARC_SHIFT (28U)
#define ENET_MACCFG_SARC_SET(x) (((uint32_t)(x) << ENET_MACCFG_SARC_SHIFT) & ENET_MACCFG_SARC_MASK)
#define ENET_MACCFG_SARC_GET(x) (((uint32_t)(x) & ENET_MACCFG_SARC_MASK) >> ENET_MACCFG_SARC_SHIFT)

