hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/*
 * ESVL (rw)
 *
 * Enable S-VLAN
 *  When this bit is set, the MAC transmitter and receiver also consider the S-VLAN (Type = 0x88A8) frames as valid VLAN tagged frames.
 */
#define ENET_VLAN_TAG_ESVL_MASK (0x40000UL)
#define ENET_VLAN_TAG_ESVL_SHIFT (18U)
#define ENET_VLAN_TAG_ESVL_SET(x) (((uint32_t)(x) << ENET_VLAN_TAG_ESVL_SHIFT) & ENET_VLAN_TAG_ESVL_MASK)
#define ENET_VLAN_TAG_ESVL_GET(x) (((uint32_t)(x) & ENET_VLAN_TAG_ESVL_MASK) >> ENET_VLAN_TAG_ESVL_SHIFT)

/*
 * VTIM (rw)
 *
 * VLAN Tag Inverse Match Enable
 * When set, this bit enables the VLAN Tag inverse matching. The frames that do not have matching VLAN Tag are marked as matched. When reset, this bit enables the VLAN Tag perfect matching. The frames with matched VLAN Tag are marked as matched.
 */
#define ENET_VLAN_TAG_VTIM_MASK (0x20000UL)
#define ENET_VLAN_TAG_VTIM_SHIFT (17U)
#define ENET_VLAN_TAG_VTIM_SET(x) (((uint32_t)(x) << ENET_VLAN_TAG_VTIM_SHIFT) & ENET_VLAN_TAG_VTIM_MASK)
#define ENET_VLAN_TAG_VTIM_GET(x) (((uint32_t)(x) & ENET_VLAN_TAG_VTIM_MASK) >> ENET_VLAN_TAG_VTIM_SHIFT)

/*
 * ETV (rw)
 *
 * Enable 12-Bit VLAN Tag Comparison
 *  When this bit is set, a 12-bit VLAN identifier is used for comparing and filtering instead of the complete 16-bit VLAN tag. Bits [11:0] of VLAN tag are compared with the corresponding field in the received VLAN-tagged frame. Similarly, when enabled, only 12 bits of the VLAN tag in the received frame are used for hash-based VLAN filtering. When this bit is reset, all 16 bits of the 15th and 16th bytes of the received VLAN frame are used for comparison and VLAN hash filtering.
 */
#define ENET_VLAN_TAG_ETV_MASK (0x10000UL)
#define ENET_VLAN_TAG_ETV_SHIFT (16U)
#define ENET_VLAN_TAG_ETV_SET(x) (((uint32_t)(x) << ENET_VLAN_TAG_ETV_SHIFT) & ENET_VLAN_TAG_ETV_MASK)
#define ENET_VLAN_TAG_ETV_GET(x) (((uint32_t)(x) & ENET_VLAN_TAG_ETV_MASK) >> ENET_VLAN_TAG_ETV_SHIFT)

/*
 * VL (rw)
 *
 * VLAN Tag Identifier for Receive Frames
 *  This field contains the 802.1Q VLAN tag to identify the VLAN frames and is compared to the 15th and 16th bytes of the frames being received for VLAN frames. The following list describes the bits of this field: - Bits [15:13]: User Priority - Bit 12: Canonical Format Indicator (CFI) or Drop Eligible Indicator (DEI) - Bits[11:0]: VLAN tag’s VLAN Identifier (VID) field When the ETV bit is set, only the VID (Bits[11:0]) is used for comparison. If VL (VL[11:0] if ETV is set) is all zeros, the MAC does not check the fifteenth and 16th bytes for VLAN tag comparison, and declares all frames with a Type field value of 0x8100 or 0x88a8 as VLAN frames.
 */
#define ENET_VLAN_TAG_VL_MASK (0xFFFFU)
#define ENET_VLAN_TAG_VL_SHIFT (0U)
#define ENET_VLAN_TAG_VL_SET(x) (((uint32_t)(x) << ENET_VLAN_TAG_VL_SHIFT) & ENET_VLAN_TAG_VL_MASK)
#define ENET_VLAN_TAG_VL_GET(x) (((uint32_t)(x) & ENET_VLAN_TAG_VL_MASK) >> ENET_VLAN_TAG_VL_SHIFT)

/* Bitfield definition for register: VERSION */
/*
 * USERVER (RO)
 *
 * User-defined Version
 */
#define ENET_VERSION_USERVER_MASK (0xFF00U)
#define ENET_VERSION_USERVER_SHIFT (8U)
#define ENET_VERSION_USERVER_GET(x) (((uint32_t)(x) & ENET_VERSION_USERVER_MASK) >> ENET_VERSION_USERVER_SHIFT)

/*
 * SNPSVER (RO)
 *
 * Synopsys-defined Version (3.7)
 */
#define ENET_VERSION_SNPSVER_MASK (0xFFU)
#define ENET_VERSION_SNPSVER_SHIFT (0U)
#define ENET_VERSION_SNPSVER_GET(x) (((uint32_t)(x) & ENET_VERSION_SNPSVER_MASK) >> ENET_VERSION_SNPSVER_SHIFT)

/* Bitfield definition for register: DEBUGGING */
/*
 * TXSTSFSTS (RO)
 *
 * MTL TxStatus FIFO Full Status
 *  When high, this bit indicates that the MTL TxStatus FIFO is full. Therefore, the MTL cannot accept any more frames for transmission. This bit is reserved in the GMAC-AHB and GMAC-DMA configurations.
 */
#define ENET_DEBUGGING_TXSTSFSTS_MASK (0x2000000UL)
#define ENET_DEBUGGING_TXSTSFSTS_SHIFT (25U)
#define ENET_DEBUGGING_TXSTSFSTS_GET(x) (((uint32_t)(x) & ENET_DEBUGGING_TXSTSFSTS_MASK) >> ENET_DEBUGGING_TXSTSFSTS_SHIFT)

/*
 * TXFSTS (RO)
 *
 * MTL Tx FIFO Not Empty Status
 * When high, this bit indicates that the MTL Tx FIFO is not empty and some data is left for transmission.
 */
#define ENET_DEBUGGING_TXFSTS_MASK (0x1000000UL)
#define ENET_DEBUGGING_TXFSTS_SHIFT (24U)
#define ENET_DEBUGGING_TXFSTS_GET(x) (((uint32_t)(x) & ENET_DEBUGGING_TXFSTS_MASK) >> ENET_DEBUGGING_TXFSTS_SHIFT)

/*
 * TWCSTS (RO)
 *
 * MTL Tx FIFO Write Controller Status
 * When high, this bit indicates that the MTL Tx FIFO Write Controller is active and is transferring data to the Tx FIFO.
 */
#define ENET_DEBUGGING_TWCSTS_MASK (0x400000UL)
#define ENET_DEBUGGING_TWCSTS_SHIFT (22U)
#define ENET_DEBUGGING_TWCSTS_GET(x) (((uint32_t)(x) & ENET_DEBUGGING_TWCSTS_MASK) >> ENET_DEBUGGING_TWCSTS_SHIFT)

/*
 * TRCSTS (RO)
 *
 * MTL Tx FIFO Read Controller Status
 * This field indicates the state of the Tx FIFO Read Controller:
 * - 00: IDLE state
 * - 01: READ state (transferring data to the MAC transmitter)
 * - 10: Waiting for TxStatus from the MAC transmitter
 * - 11: Writing the received TxStatus or flushing the Tx FIFO
 */
#define ENET_DEBUGGING_TRCSTS_MASK (0x300000UL)
#define ENET_DEBUGGING_TRCSTS_SHIFT (20U)
#define ENET_DEBUGGING_TRCSTS_GET(x) (((uint32_t)(x) & ENET_DEBUGGING_TRCSTS_MASK) >> ENET_DEBUGGING_TRCSTS_SHIFT)

/*
 * TXPAUSED (RO)
 *
 * MAC Transmitter in Pause
 * When high, this bit indicates that the MAC transmitter is in the Pause condition (in the full-duplex-only mode) and hence does not schedule any frame for transmission.
 */
#define ENET_DEBUGGING_TXPAUSED_MASK (0x80000UL)
#define ENET_DEBUGGING_TXPAUSED_SHIFT (19U)
#define ENET_DEBUGGING_TXPAUSED_GET(x) (((uint32_t)(x) & ENET_DEBUGGING_TXPAUSED_MASK) >> ENET_DEBUGGING_TXPAUSED_SHIFT)

/*
 * TFCSTS (RO)
 *
 * MAC Transmit Frame Controller Status
 * This field indicates the state of the MAC Transmit Frame Controller module:
 * - 00: IDLE state
 * - 01: Waiting for status of previous frame or IFG or backoff period to be over
 * - 10: Generating and transmitting a Pause frame (in the full-duplex mode)
 * - 11: Transferring input frame for transmission
 */
#define ENET_DEBUGGING_TFCSTS_MASK (0x60000UL)
#define ENET_DEBUGGING_TFCSTS_SHIFT (17U)
#define ENET_DEBUGGING_TFCSTS_GET(x) (((uint32_t)(x) & ENET_DEBUGGING_TFCSTS_MASK) >> ENET_DEBUGGING_TFCSTS_SHIFT)

