hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/*
 * TPESTS (RO)
 *
 * MAC GMII or MII Transmit Protocol Engine Status
 *  When high, this bit indicates that the MAC GMII or MII transmit protocol engine is actively transmitting data and is not in the IDLE state.
 */
#define ENET_DEBUGGING_TPESTS_MASK (0x10000UL)
#define ENET_DEBUGGING_TPESTS_SHIFT (16U)
#define ENET_DEBUGGING_TPESTS_GET(x) (((uint32_t)(x) & ENET_DEBUGGING_TPESTS_MASK) >> ENET_DEBUGGING_TPESTS_SHIFT)

/*
 * RXFSTS (RO)
 *
 * MTL RxFIFO Fill-Level Status
 * This field gives the status of the fill-level of the Rx FIFO:
 * - 00: Rx FIFO Empty
 * - 01: Rx FIFO fill-level below flow-control deactivate threshold
 * - 10: Rx FIFO fill-level above flow-control activate threshold
 * - 11: Rx FIFO Full
 */
#define ENET_DEBUGGING_RXFSTS_MASK (0x300U)
#define ENET_DEBUGGING_RXFSTS_SHIFT (8U)
#define ENET_DEBUGGING_RXFSTS_GET(x) (((uint32_t)(x) & ENET_DEBUGGING_RXFSTS_MASK) >> ENET_DEBUGGING_RXFSTS_SHIFT)

/*
 * RRCSTS (RO)
 *
 * MTL RxFIFO Read Controller State
 * This field gives the state of the Rx FIFO read Controller:
 * - 00: IDLE state
 * - 01: Reading frame data
 * - 10: Reading frame status (or timestamp)
 * - 11: Flushing the frame data and status
 */
#define ENET_DEBUGGING_RRCSTS_MASK (0x60U)
#define ENET_DEBUGGING_RRCSTS_SHIFT (5U)
#define ENET_DEBUGGING_RRCSTS_GET(x) (((uint32_t)(x) & ENET_DEBUGGING_RRCSTS_MASK) >> ENET_DEBUGGING_RRCSTS_SHIFT)

/*
 * RWCSTS (RO)
 *
 * MTL Rx FIFO Write Controller Active Status
 *  When high, this bit indicates that the MTL Rx FIFO Write Controller is active and is transferring a received frame to the FIFO.
 */
#define ENET_DEBUGGING_RWCSTS_MASK (0x10U)
#define ENET_DEBUGGING_RWCSTS_SHIFT (4U)
#define ENET_DEBUGGING_RWCSTS_GET(x) (((uint32_t)(x) & ENET_DEBUGGING_RWCSTS_MASK) >> ENET_DEBUGGING_RWCSTS_SHIFT)

/*
 * RFCFCSTS (RO)
 *
 * MAC Receive Frame FIFO Controller Status
 *  When high, this field indicates the active state of the small FIFO Read and Write controllers of the MAC Receive Frame Controller Module. - RFCFCSTS[1] represents the status of small FIFO Read controller. - RFCFCSTS[0] represents the status of small FIFO Write controller.
 */
#define ENET_DEBUGGING_RFCFCSTS_MASK (0x6U)
#define ENET_DEBUGGING_RFCFCSTS_SHIFT (1U)
#define ENET_DEBUGGING_RFCFCSTS_GET(x) (((uint32_t)(x) & ENET_DEBUGGING_RFCFCSTS_MASK) >> ENET_DEBUGGING_RFCFCSTS_SHIFT)

/*
 * RPESTS (RO)
 *
 * MAC GMII or MII Receive Protocol Engine Status
 * When high, this bit indicates that the MAC GMII or MII receive protocol engine is actively receiving data and not in IDLE state.
 */
#define ENET_DEBUGGING_RPESTS_MASK (0x1U)
#define ENET_DEBUGGING_RPESTS_SHIFT (0U)
#define ENET_DEBUGGING_RPESTS_GET(x) (((uint32_t)(x) & ENET_DEBUGGING_RPESTS_MASK) >> ENET_DEBUGGING_RPESTS_SHIFT)

/* Bitfield definition for register: RWKFRMFILT */
/*
 * WKUPFRMFILT (RW)
 *
 * This is the address through which the application writes or reads the remote wake-up frame filter registers (wkupfmfilter_reg). The wkupfmfilter_reg register is a pointer to eight wkupfmfilter_reg registers. The wkupfmfilter_reg register is loaded by sequentially loading the eight register values. Eight sequential writes to this address (0x0028) write all wkupfmfilter_reg registers. Similarly, eight sequential reads from this address (0x0028) read all wkupfmfilter_reg registers
 */
#define ENET_RWKFRMFILT_WKUPFRMFILT_MASK (0xFFFFFFFFUL)
#define ENET_RWKFRMFILT_WKUPFRMFILT_SHIFT (0U)
#define ENET_RWKFRMFILT_WKUPFRMFILT_SET(x) (((uint32_t)(x) << ENET_RWKFRMFILT_WKUPFRMFILT_SHIFT) & ENET_RWKFRMFILT_WKUPFRMFILT_MASK)
#define ENET_RWKFRMFILT_WKUPFRMFILT_GET(x) (((uint32_t)(x) & ENET_RWKFRMFILT_WKUPFRMFILT_MASK) >> ENET_RWKFRMFILT_WKUPFRMFILT_SHIFT)

/* Bitfield definition for register: PMT_CSR */
/*
 * RWKFILTRST (rw)
 *
 * Remote Wake-Up Frame Filter Register Pointer Reset
 * When this bit is set, it resets the remote wake-up frame filter register pointer to 3’b000. It is automatically cleared after 1 clock cycle.
 */
#define ENET_PMT_CSR_RWKFILTRST_MASK (0x80000000UL)
#define ENET_PMT_CSR_RWKFILTRST_SHIFT (31U)
#define ENET_PMT_CSR_RWKFILTRST_SET(x) (((uint32_t)(x) << ENET_PMT_CSR_RWKFILTRST_SHIFT) & ENET_PMT_CSR_RWKFILTRST_MASK)
#define ENET_PMT_CSR_RWKFILTRST_GET(x) (((uint32_t)(x) & ENET_PMT_CSR_RWKFILTRST_MASK) >> ENET_PMT_CSR_RWKFILTRST_SHIFT)

/*
 * RWKPTR (rw)
 *
 * Remote Wake-up FIFO Pointer
 * This field gives the current value (0 to 31) of the Remote Wake-up Frame filter register pointer. When the value of this pointer is equal to 7, 15, 23 or 31, the contents of the Remote Wake-up Frame Filter Register are transferred to the clk_rx_i domain when a write occurs to that register. The maximum value of the pointer is 7, 15, 23 and 31 respectively depending on the number of Remote Wakeup Filters selected during configuration.
 */
#define ENET_PMT_CSR_RWKPTR_MASK (0x1F000000UL)
#define ENET_PMT_CSR_RWKPTR_SHIFT (24U)
#define ENET_PMT_CSR_RWKPTR_SET(x) (((uint32_t)(x) << ENET_PMT_CSR_RWKPTR_SHIFT) & ENET_PMT_CSR_RWKPTR_MASK)
#define ENET_PMT_CSR_RWKPTR_GET(x) (((uint32_t)(x) & ENET_PMT_CSR_RWKPTR_MASK) >> ENET_PMT_CSR_RWKPTR_SHIFT)

/*
 * GLBLUCAST (rw)
 *
 * Global Unicast
 * When set, enables any unicast packet filtered by the MAC (DAF) address recognition to be a remote wake-up frame.
 */
#define ENET_PMT_CSR_GLBLUCAST_MASK (0x200U)
#define ENET_PMT_CSR_GLBLUCAST_SHIFT (9U)
#define ENET_PMT_CSR_GLBLUCAST_SET(x) (((uint32_t)(x) << ENET_PMT_CSR_GLBLUCAST_SHIFT) & ENET_PMT_CSR_GLBLUCAST_MASK)
#define ENET_PMT_CSR_GLBLUCAST_GET(x) (((uint32_t)(x) & ENET_PMT_CSR_GLBLUCAST_MASK) >> ENET_PMT_CSR_GLBLUCAST_SHIFT)

/*
 * RWKPRCVD (rw)
 *
 * Remote Wake-Up Frame Received
 * When set, this bit indicates the power management event is generated because of the reception of a remote wake-up frame. This bit is cleared by a Read into this register.
 */
#define ENET_PMT_CSR_RWKPRCVD_MASK (0x40U)
#define ENET_PMT_CSR_RWKPRCVD_SHIFT (6U)
#define ENET_PMT_CSR_RWKPRCVD_SET(x) (((uint32_t)(x) << ENET_PMT_CSR_RWKPRCVD_SHIFT) & ENET_PMT_CSR_RWKPRCVD_MASK)
#define ENET_PMT_CSR_RWKPRCVD_GET(x) (((uint32_t)(x) & ENET_PMT_CSR_RWKPRCVD_MASK) >> ENET_PMT_CSR_RWKPRCVD_SHIFT)

