hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/*
 * RXFOVFIS (rw)
 *
 * MMC Receive FIFO Overflow Frame Counter Interrupt Status
 * This bit is set when the rxfifooverflow counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXFOVFIS_MASK (0x200000UL)
#define ENET_MMC_INTR_RX_RXFOVFIS_SHIFT (21U)
#define ENET_MMC_INTR_RX_RXFOVFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXFOVFIS_SHIFT) & ENET_MMC_INTR_RX_RXFOVFIS_MASK)
#define ENET_MMC_INTR_RX_RXFOVFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXFOVFIS_MASK) >> ENET_MMC_INTR_RX_RXFOVFIS_SHIFT)

/*
 * RXPAUSFIS (rw)
 *
 * MMC Receive Pause Frame Counter Interrupt Status
 * This bit is set when the rxpauseframes counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXPAUSFIS_MASK (0x100000UL)
#define ENET_MMC_INTR_RX_RXPAUSFIS_SHIFT (20U)
#define ENET_MMC_INTR_RX_RXPAUSFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXPAUSFIS_SHIFT) & ENET_MMC_INTR_RX_RXPAUSFIS_MASK)
#define ENET_MMC_INTR_RX_RXPAUSFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXPAUSFIS_MASK) >> ENET_MMC_INTR_RX_RXPAUSFIS_SHIFT)

/*
 * RXORANGEFIS (rw)
 *
 * MMC Receive Out Of Range Error Frame Counter Interrupt Status.
 * This bit is set when the rxoutofrangetype counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXORANGEFIS_MASK (0x80000UL)
#define ENET_MMC_INTR_RX_RXORANGEFIS_SHIFT (19U)
#define ENET_MMC_INTR_RX_RXORANGEFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXORANGEFIS_SHIFT) & ENET_MMC_INTR_RX_RXORANGEFIS_MASK)
#define ENET_MMC_INTR_RX_RXORANGEFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXORANGEFIS_MASK) >> ENET_MMC_INTR_RX_RXORANGEFIS_SHIFT)

/*
 * RXLENERFIS (rw)
 *
 * MMC Receive Length Error Frame Counter Interrupt Status
 * This bit is set when the rxlengtherror counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXLENERFIS_MASK (0x40000UL)
#define ENET_MMC_INTR_RX_RXLENERFIS_SHIFT (18U)
#define ENET_MMC_INTR_RX_RXLENERFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXLENERFIS_SHIFT) & ENET_MMC_INTR_RX_RXLENERFIS_MASK)
#define ENET_MMC_INTR_RX_RXLENERFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXLENERFIS_MASK) >> ENET_MMC_INTR_RX_RXLENERFIS_SHIFT)

/*
 * RXUCGFIS (rw)
 *
 * MMC Receive Unicast Good Frame Counter Interrupt Status
 * This bit is set when the rxunicastframes_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXUCGFIS_MASK (0x20000UL)
#define ENET_MMC_INTR_RX_RXUCGFIS_SHIFT (17U)
#define ENET_MMC_INTR_RX_RXUCGFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXUCGFIS_SHIFT) & ENET_MMC_INTR_RX_RXUCGFIS_MASK)
#define ENET_MMC_INTR_RX_RXUCGFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXUCGFIS_MASK) >> ENET_MMC_INTR_RX_RXUCGFIS_SHIFT)

/*
 * RX1024TMAXOCTGBFIS (rw)
 *
 * MMC Receive 1024 to Maximum Octet Good Bad Frame Counter Interrupt Status.
 * This bit is set when the rx1024tomaxoctets_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RX1024TMAXOCTGBFIS_MASK (0x10000UL)
#define ENET_MMC_INTR_RX_RX1024TMAXOCTGBFIS_SHIFT (16U)
#define ENET_MMC_INTR_RX_RX1024TMAXOCTGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RX1024TMAXOCTGBFIS_SHIFT) & ENET_MMC_INTR_RX_RX1024TMAXOCTGBFIS_MASK)
#define ENET_MMC_INTR_RX_RX1024TMAXOCTGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RX1024TMAXOCTGBFIS_MASK) >> ENET_MMC_INTR_RX_RX1024TMAXOCTGBFIS_SHIFT)

/*
 * RX512T1023OCTGBFIS (rw)
 *
 * MMC Receive 512 to 1023 Octet Good Bad Frame Counter Interrupt Status
 * This bit is set when the rx512to1023octets_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RX512T1023OCTGBFIS_MASK (0x8000U)
#define ENET_MMC_INTR_RX_RX512T1023OCTGBFIS_SHIFT (15U)
#define ENET_MMC_INTR_RX_RX512T1023OCTGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RX512T1023OCTGBFIS_SHIFT) & ENET_MMC_INTR_RX_RX512T1023OCTGBFIS_MASK)
#define ENET_MMC_INTR_RX_RX512T1023OCTGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RX512T1023OCTGBFIS_MASK) >> ENET_MMC_INTR_RX_RX512T1023OCTGBFIS_SHIFT)

/*
 * RX256T511OCTGBFIS (rw)
 *
 * MMC Receive 256 to 511 Octet Good Bad Frame Counter Interrupt Status
 * This bit is set when the rx256to511octets_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RX256T511OCTGBFIS_MASK (0x4000U)
#define ENET_MMC_INTR_RX_RX256T511OCTGBFIS_SHIFT (14U)
#define ENET_MMC_INTR_RX_RX256T511OCTGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RX256T511OCTGBFIS_SHIFT) & ENET_MMC_INTR_RX_RX256T511OCTGBFIS_MASK)
#define ENET_MMC_INTR_RX_RX256T511OCTGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RX256T511OCTGBFIS_MASK) >> ENET_MMC_INTR_RX_RX256T511OCTGBFIS_SHIFT)

/*
 * RX128T255OCTGBFIS (rw)
 *
 * MMC Receive 128 to 255 Octet Good Bad Frame Counter Interrupt Status
 * This bit is set when the rx128to255octets_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RX128T255OCTGBFIS_MASK (0x2000U)
#define ENET_MMC_INTR_RX_RX128T255OCTGBFIS_SHIFT (13U)
#define ENET_MMC_INTR_RX_RX128T255OCTGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RX128T255OCTGBFIS_SHIFT) & ENET_MMC_INTR_RX_RX128T255OCTGBFIS_MASK)
#define ENET_MMC_INTR_RX_RX128T255OCTGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RX128T255OCTGBFIS_MASK) >> ENET_MMC_INTR_RX_RX128T255OCTGBFIS_SHIFT)

/*
 * RX65T127OCTGBFIS (rw)
 *
 * MMC Receive 65 to 127 Octet Good Bad Frame Counter Interrupt Status
 * This bit is set when the rx65to127octets_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RX65T127OCTGBFIS_MASK (0x1000U)
#define ENET_MMC_INTR_RX_RX65T127OCTGBFIS_SHIFT (12U)
#define ENET_MMC_INTR_RX_RX65T127OCTGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RX65T127OCTGBFIS_SHIFT) & ENET_MMC_INTR_RX_RX65T127OCTGBFIS_MASK)
#define ENET_MMC_INTR_RX_RX65T127OCTGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RX65T127OCTGBFIS_MASK) >> ENET_MMC_INTR_RX_RX65T127OCTGBFIS_SHIFT)

