hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/*
 * RX64OCTGBFIS (rw)
 *
 * MMC Receive 64 Octet Good Bad Frame Counter Interrupt Status
 * This bit is set when the rx64octets_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RX64OCTGBFIS_MASK (0x800U)
#define ENET_MMC_INTR_RX_RX64OCTGBFIS_SHIFT (11U)
#define ENET_MMC_INTR_RX_RX64OCTGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RX64OCTGBFIS_SHIFT) & ENET_MMC_INTR_RX_RX64OCTGBFIS_MASK)
#define ENET_MMC_INTR_RX_RX64OCTGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RX64OCTGBFIS_MASK) >> ENET_MMC_INTR_RX_RX64OCTGBFIS_SHIFT)

/*
 * RXOSIZEGFIS (rw)
 *
 * MMC Receive Oversize Good Frame Counter Interrupt Status
 * This bit is set when the rxoversize_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXOSIZEGFIS_MASK (0x400U)
#define ENET_MMC_INTR_RX_RXOSIZEGFIS_SHIFT (10U)
#define ENET_MMC_INTR_RX_RXOSIZEGFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXOSIZEGFIS_SHIFT) & ENET_MMC_INTR_RX_RXOSIZEGFIS_MASK)
#define ENET_MMC_INTR_RX_RXOSIZEGFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXOSIZEGFIS_MASK) >> ENET_MMC_INTR_RX_RXOSIZEGFIS_SHIFT)

/*
 * RXUSIZEGFIS (rw)
 *
 * MMC Receive Undersize Good Frame Counter Interrupt Status
 * This bit is set when the rxundersize_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXUSIZEGFIS_MASK (0x200U)
#define ENET_MMC_INTR_RX_RXUSIZEGFIS_SHIFT (9U)
#define ENET_MMC_INTR_RX_RXUSIZEGFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXUSIZEGFIS_SHIFT) & ENET_MMC_INTR_RX_RXUSIZEGFIS_MASK)
#define ENET_MMC_INTR_RX_RXUSIZEGFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXUSIZEGFIS_MASK) >> ENET_MMC_INTR_RX_RXUSIZEGFIS_SHIFT)

/*
 * RXJABERFIS (rw)
 *
 * MMC Receive Jabber Error Frame Counter Interrupt Status
 * This bit is set when the rxjabbererror counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXJABERFIS_MASK (0x100U)
#define ENET_MMC_INTR_RX_RXJABERFIS_SHIFT (8U)
#define ENET_MMC_INTR_RX_RXJABERFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXJABERFIS_SHIFT) & ENET_MMC_INTR_RX_RXJABERFIS_MASK)
#define ENET_MMC_INTR_RX_RXJABERFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXJABERFIS_MASK) >> ENET_MMC_INTR_RX_RXJABERFIS_SHIFT)

/*
 * RXRUNTFIS (rw)
 *
 * MMC Receive Runt Frame Counter Interrupt Status
 * This bit is set when the rxrunterror counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXRUNTFIS_MASK (0x80U)
#define ENET_MMC_INTR_RX_RXRUNTFIS_SHIFT (7U)
#define ENET_MMC_INTR_RX_RXRUNTFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXRUNTFIS_SHIFT) & ENET_MMC_INTR_RX_RXRUNTFIS_MASK)
#define ENET_MMC_INTR_RX_RXRUNTFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXRUNTFIS_MASK) >> ENET_MMC_INTR_RX_RXRUNTFIS_SHIFT)

/*
 * RXALGNERFIS (rw)
 *
 * MMC Receive Alignment Error Frame Counter Interrupt Status
 * This bit is set when the rxalignmenterror counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXALGNERFIS_MASK (0x40U)
#define ENET_MMC_INTR_RX_RXALGNERFIS_SHIFT (6U)
#define ENET_MMC_INTR_RX_RXALGNERFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXALGNERFIS_SHIFT) & ENET_MMC_INTR_RX_RXALGNERFIS_MASK)
#define ENET_MMC_INTR_RX_RXALGNERFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXALGNERFIS_MASK) >> ENET_MMC_INTR_RX_RXALGNERFIS_SHIFT)

/*
 * RXCRCERFIS (rw)
 *
 * MMC Receive CRC Error Frame Counter Interrupt Status
 * This bit is set when the rxcrcerror counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXCRCERFIS_MASK (0x20U)
#define ENET_MMC_INTR_RX_RXCRCERFIS_SHIFT (5U)
#define ENET_MMC_INTR_RX_RXCRCERFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXCRCERFIS_SHIFT) & ENET_MMC_INTR_RX_RXCRCERFIS_MASK)
#define ENET_MMC_INTR_RX_RXCRCERFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXCRCERFIS_MASK) >> ENET_MMC_INTR_RX_RXCRCERFIS_SHIFT)

/*
 * RXMCGFIS (rw)
 *
 * MMC Receive Multicast Good Frame Counter Interrupt Status
 * This bit is set when the rxmulticastframes_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXMCGFIS_MASK (0x10U)
#define ENET_MMC_INTR_RX_RXMCGFIS_SHIFT (4U)
#define ENET_MMC_INTR_RX_RXMCGFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXMCGFIS_SHIFT) & ENET_MMC_INTR_RX_RXMCGFIS_MASK)
#define ENET_MMC_INTR_RX_RXMCGFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXMCGFIS_MASK) >> ENET_MMC_INTR_RX_RXMCGFIS_SHIFT)

/*
 * RXBCGFIS (rw)
 *
 * MMC Receive Broadcast Good Frame Counter Interrupt Status
 * This bit is set when the rxbroadcastframes_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXBCGFIS_MASK (0x8U)
#define ENET_MMC_INTR_RX_RXBCGFIS_SHIFT (3U)
#define ENET_MMC_INTR_RX_RXBCGFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXBCGFIS_SHIFT) & ENET_MMC_INTR_RX_RXBCGFIS_MASK)
#define ENET_MMC_INTR_RX_RXBCGFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXBCGFIS_MASK) >> ENET_MMC_INTR_RX_RXBCGFIS_SHIFT)

/*
 * RXGOCTIS (rw)
 *
 * MMC Receive Good Octet Counter Interrupt Status
 * This bit is set when the rxoctetcount_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXGOCTIS_MASK (0x4U)
#define ENET_MMC_INTR_RX_RXGOCTIS_SHIFT (2U)
#define ENET_MMC_INTR_RX_RXGOCTIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXGOCTIS_SHIFT) & ENET_MMC_INTR_RX_RXGOCTIS_MASK)
#define ENET_MMC_INTR_RX_RXGOCTIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXGOCTIS_MASK) >> ENET_MMC_INTR_RX_RXGOCTIS_SHIFT)

/*
 * RXGBOCTIS (rw)
 *
 * MMC Receive Good Bad Octet Counter Interrupt Status
 * This bit is set when the rxoctetcount_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXGBOCTIS_MASK (0x2U)
#define ENET_MMC_INTR_RX_RXGBOCTIS_SHIFT (1U)
#define ENET_MMC_INTR_RX_RXGBOCTIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXGBOCTIS_SHIFT) & ENET_MMC_INTR_RX_RXGBOCTIS_MASK)
#define ENET_MMC_INTR_RX_RXGBOCTIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXGBOCTIS_MASK) >> ENET_MMC_INTR_RX_RXGBOCTIS_SHIFT)

