hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/*
 * RXGBFRMIS (rw)
 *
 * MMC Receive Good Bad Frame Counter Interrupt Status
 * This bit is set when the rxframecount_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_RX_RXGBFRMIS_MASK (0x1U)
#define ENET_MMC_INTR_RX_RXGBFRMIS_SHIFT (0U)
#define ENET_MMC_INTR_RX_RXGBFRMIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_RX_RXGBFRMIS_SHIFT) & ENET_MMC_INTR_RX_RXGBFRMIS_MASK)
#define ENET_MMC_INTR_RX_RXGBFRMIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_RX_RXGBFRMIS_MASK) >> ENET_MMC_INTR_RX_RXGBFRMIS_SHIFT)

/* Bitfield definition for register: MMC_INTR_TX */
/*
 * TXOSIZEGFIS (rw)
 *
 * MMC Transmit Oversize Good Frame Counter Interrupt Status
 * This bit is set when the txoversize_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXOSIZEGFIS_MASK (0x2000000UL)
#define ENET_MMC_INTR_TX_TXOSIZEGFIS_SHIFT (25U)
#define ENET_MMC_INTR_TX_TXOSIZEGFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXOSIZEGFIS_SHIFT) & ENET_MMC_INTR_TX_TXOSIZEGFIS_MASK)
#define ENET_MMC_INTR_TX_TXOSIZEGFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXOSIZEGFIS_MASK) >> ENET_MMC_INTR_TX_TXOSIZEGFIS_SHIFT)

/*
 * TXVLANGFIS (rw)
 *
 * MMC Transmit VLAN Good Frame Counter Interrupt Status
 * This bit is set when the txvlanframes_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXVLANGFIS_MASK (0x1000000UL)
#define ENET_MMC_INTR_TX_TXVLANGFIS_SHIFT (24U)
#define ENET_MMC_INTR_TX_TXVLANGFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXVLANGFIS_SHIFT) & ENET_MMC_INTR_TX_TXVLANGFIS_MASK)
#define ENET_MMC_INTR_TX_TXVLANGFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXVLANGFIS_MASK) >> ENET_MMC_INTR_TX_TXVLANGFIS_SHIFT)

/*
 * TXPAUSFIS (rw)
 *
 * MMC Transmit Pause Frame Counter Interrupt Status
 * This bit is set when the txpauseframeserror counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXPAUSFIS_MASK (0x800000UL)
#define ENET_MMC_INTR_TX_TXPAUSFIS_SHIFT (23U)
#define ENET_MMC_INTR_TX_TXPAUSFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXPAUSFIS_SHIFT) & ENET_MMC_INTR_TX_TXPAUSFIS_MASK)
#define ENET_MMC_INTR_TX_TXPAUSFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXPAUSFIS_MASK) >> ENET_MMC_INTR_TX_TXPAUSFIS_SHIFT)

/*
 * TXEXDEFFIS (rw)
 *
 * MMC Transmit Excessive Deferral Frame Counter Interrupt Status
 * This bit is set when the txexcessdef counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXEXDEFFIS_MASK (0x400000UL)
#define ENET_MMC_INTR_TX_TXEXDEFFIS_SHIFT (22U)
#define ENET_MMC_INTR_TX_TXEXDEFFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXEXDEFFIS_SHIFT) & ENET_MMC_INTR_TX_TXEXDEFFIS_MASK)
#define ENET_MMC_INTR_TX_TXEXDEFFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXEXDEFFIS_MASK) >> ENET_MMC_INTR_TX_TXEXDEFFIS_SHIFT)

/*
 * TXGFRMIS (rw)
 *
 * MMC Transmit Good Frame Counter Interrupt Status
 * This bit is set when the txframecount_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXGFRMIS_MASK (0x200000UL)
#define ENET_MMC_INTR_TX_TXGFRMIS_SHIFT (21U)
#define ENET_MMC_INTR_TX_TXGFRMIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXGFRMIS_SHIFT) & ENET_MMC_INTR_TX_TXGFRMIS_MASK)
#define ENET_MMC_INTR_TX_TXGFRMIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXGFRMIS_MASK) >> ENET_MMC_INTR_TX_TXGFRMIS_SHIFT)

/*
 * TXGOCTIS (rw)
 *
 * MMC Transmit Good Octet Counter Interrupt Status
 * This bit is set when the txoctetcount_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXGOCTIS_MASK (0x100000UL)
#define ENET_MMC_INTR_TX_TXGOCTIS_SHIFT (20U)
#define ENET_MMC_INTR_TX_TXGOCTIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXGOCTIS_SHIFT) & ENET_MMC_INTR_TX_TXGOCTIS_MASK)
#define ENET_MMC_INTR_TX_TXGOCTIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXGOCTIS_MASK) >> ENET_MMC_INTR_TX_TXGOCTIS_SHIFT)

/*
 * TXCARERFIS (rw)
 *
 * MMC Transmit Carrier Error Frame Counter Interrupt Status
 * This bit is set when the txcarriererror counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXCARERFIS_MASK (0x80000UL)
#define ENET_MMC_INTR_TX_TXCARERFIS_SHIFT (19U)
#define ENET_MMC_INTR_TX_TXCARERFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXCARERFIS_SHIFT) & ENET_MMC_INTR_TX_TXCARERFIS_MASK)
#define ENET_MMC_INTR_TX_TXCARERFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXCARERFIS_MASK) >> ENET_MMC_INTR_TX_TXCARERFIS_SHIFT)

/*
 * TXEXCOLFIS (rw)
 *
 * MMC Transmit Excessive Collision Frame Counter Interrupt Status
 * This bit is set when the txexesscol counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXEXCOLFIS_MASK (0x40000UL)
#define ENET_MMC_INTR_TX_TXEXCOLFIS_SHIFT (18U)
#define ENET_MMC_INTR_TX_TXEXCOLFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXEXCOLFIS_SHIFT) & ENET_MMC_INTR_TX_TXEXCOLFIS_MASK)
#define ENET_MMC_INTR_TX_TXEXCOLFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXEXCOLFIS_MASK) >> ENET_MMC_INTR_TX_TXEXCOLFIS_SHIFT)

/*
 * TXLATCOLFIS (rw)
 *
 * MMC Transmit Late Collision Frame Counter Interrupt Status
 * This bit is set when the txlatecol counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXLATCOLFIS_MASK (0x20000UL)
#define ENET_MMC_INTR_TX_TXLATCOLFIS_SHIFT (17U)
#define ENET_MMC_INTR_TX_TXLATCOLFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXLATCOLFIS_SHIFT) & ENET_MMC_INTR_TX_TXLATCOLFIS_MASK)
#define ENET_MMC_INTR_TX_TXLATCOLFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXLATCOLFIS_MASK) >> ENET_MMC_INTR_TX_TXLATCOLFIS_SHIFT)

/*
 * TXDEFFIS (rw)
 *
 * MMC Transmit Deferred Frame Counter Interrupt Status
 * This bit is set when the txdeferred counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXDEFFIS_MASK (0x10000UL)
#define ENET_MMC_INTR_TX_TXDEFFIS_SHIFT (16U)
#define ENET_MMC_INTR_TX_TXDEFFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXDEFFIS_SHIFT) & ENET_MMC_INTR_TX_TXDEFFIS_MASK)
#define ENET_MMC_INTR_TX_TXDEFFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXDEFFIS_MASK) >> ENET_MMC_INTR_TX_TXDEFFIS_SHIFT)

