hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/* Bitfield definition for register: TXDEFERRED */
/*
 * FRMCNT (rw)
 *
 * Number of successfully transmitted frames after a deferral in the half-duplex mode.
 */
#define ENET_TXDEFERRED_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_TXDEFERRED_FRMCNT_SHIFT (0U)
#define ENET_TXDEFERRED_FRMCNT_SET(x) (((uint32_t)(x) << ENET_TXDEFERRED_FRMCNT_SHIFT) & ENET_TXDEFERRED_FRMCNT_MASK)
#define ENET_TXDEFERRED_FRMCNT_GET(x) (((uint32_t)(x) & ENET_TXDEFERRED_FRMCNT_MASK) >> ENET_TXDEFERRED_FRMCNT_SHIFT)

/* Bitfield definition for register: TXLATECOL */
/*
 * FRMCNT (rw)
 *
 * Number of frames aborted because of late collision error.
 */
#define ENET_TXLATECOL_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_TXLATECOL_FRMCNT_SHIFT (0U)
#define ENET_TXLATECOL_FRMCNT_SET(x) (((uint32_t)(x) << ENET_TXLATECOL_FRMCNT_SHIFT) & ENET_TXLATECOL_FRMCNT_MASK)
#define ENET_TXLATECOL_FRMCNT_GET(x) (((uint32_t)(x) & ENET_TXLATECOL_FRMCNT_MASK) >> ENET_TXLATECOL_FRMCNT_SHIFT)

/* Bitfield definition for register: TXEXESSCOL */
/*
 * FRMCNT (rw)
 *
 * Number of frames aborted because of excessive (16) collision errors.
 */
#define ENET_TXEXESSCOL_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_TXEXESSCOL_FRMCNT_SHIFT (0U)
#define ENET_TXEXESSCOL_FRMCNT_SET(x) (((uint32_t)(x) << ENET_TXEXESSCOL_FRMCNT_SHIFT) & ENET_TXEXESSCOL_FRMCNT_MASK)
#define ENET_TXEXESSCOL_FRMCNT_GET(x) (((uint32_t)(x) & ENET_TXEXESSCOL_FRMCNT_MASK) >> ENET_TXEXESSCOL_FRMCNT_SHIFT)

/* Bitfield definition for register: TXCARRIERERROR */
/*
 * FRMCNT (rw)
 *
 * Number of frames aborted because of carrier sense error (no carrier or loss of carrier).
 */
#define ENET_TXCARRIERERROR_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_TXCARRIERERROR_FRMCNT_SHIFT (0U)
#define ENET_TXCARRIERERROR_FRMCNT_SET(x) (((uint32_t)(x) << ENET_TXCARRIERERROR_FRMCNT_SHIFT) & ENET_TXCARRIERERROR_FRMCNT_MASK)
#define ENET_TXCARRIERERROR_FRMCNT_GET(x) (((uint32_t)(x) & ENET_TXCARRIERERROR_FRMCNT_MASK) >> ENET_TXCARRIERERROR_FRMCNT_SHIFT)

/* Bitfield definition for register: TXOCTETCOUNT_G */
/*
 * BYTECNT (rw)
 *
 * Number of bytes transmitted, exclusive of preamble, only in good frames.
 */
#define ENET_TXOCTETCOUNT_G_BYTECNT_MASK (0xFFFFFFFFUL)
#define ENET_TXOCTETCOUNT_G_BYTECNT_SHIFT (0U)
#define ENET_TXOCTETCOUNT_G_BYTECNT_SET(x) (((uint32_t)(x) << ENET_TXOCTETCOUNT_G_BYTECNT_SHIFT) & ENET_TXOCTETCOUNT_G_BYTECNT_MASK)
#define ENET_TXOCTETCOUNT_G_BYTECNT_GET(x) (((uint32_t)(x) & ENET_TXOCTETCOUNT_G_BYTECNT_MASK) >> ENET_TXOCTETCOUNT_G_BYTECNT_SHIFT)

/* Bitfield definition for register: TXFRAMECOUNT_G */
/*
 * FRMCNT (rw)
 *
 * Number of good frames transmitted.
 */
#define ENET_TXFRAMECOUNT_G_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_TXFRAMECOUNT_G_FRMCNT_SHIFT (0U)
#define ENET_TXFRAMECOUNT_G_FRMCNT_SET(x) (((uint32_t)(x) << ENET_TXFRAMECOUNT_G_FRMCNT_SHIFT) & ENET_TXFRAMECOUNT_G_FRMCNT_MASK)
#define ENET_TXFRAMECOUNT_G_FRMCNT_GET(x) (((uint32_t)(x) & ENET_TXFRAMECOUNT_G_FRMCNT_MASK) >> ENET_TXFRAMECOUNT_G_FRMCNT_SHIFT)

/* Bitfield definition for register: TXEXCESSDEF */
/*
 * FRMCNT (rw)
 *
 * Number of frames aborted because of excessive deferral error (deferred for more than two max-sized frame times).
 */
#define ENET_TXEXCESSDEF_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_TXEXCESSDEF_FRMCNT_SHIFT (0U)
#define ENET_TXEXCESSDEF_FRMCNT_SET(x) (((uint32_t)(x) << ENET_TXEXCESSDEF_FRMCNT_SHIFT) & ENET_TXEXCESSDEF_FRMCNT_MASK)
#define ENET_TXEXCESSDEF_FRMCNT_GET(x) (((uint32_t)(x) & ENET_TXEXCESSDEF_FRMCNT_MASK) >> ENET_TXEXCESSDEF_FRMCNT_SHIFT)

/* Bitfield definition for register: TXPAUSEFRAMES */
/*
 * FRMCNT (rw)
 *
 * Number of good Pause frames transmitted.
 */
#define ENET_TXPAUSEFRAMES_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_TXPAUSEFRAMES_FRMCNT_SHIFT (0U)
#define ENET_TXPAUSEFRAMES_FRMCNT_SET(x) (((uint32_t)(x) << ENET_TXPAUSEFRAMES_FRMCNT_SHIFT) & ENET_TXPAUSEFRAMES_FRMCNT_MASK)
#define ENET_TXPAUSEFRAMES_FRMCNT_GET(x) (((uint32_t)(x) & ENET_TXPAUSEFRAMES_FRMCNT_MASK) >> ENET_TXPAUSEFRAMES_FRMCNT_SHIFT)

/* Bitfield definition for register: TXVLANFRAMES_G */
/*
 * FRMCNT (rw)
 *
 * Number of good VLAN frames transmitted, exclusive of retried frames.
 */
#define ENET_TXVLANFRAMES_G_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_TXVLANFRAMES_G_FRMCNT_SHIFT (0U)
#define ENET_TXVLANFRAMES_G_FRMCNT_SET(x) (((uint32_t)(x) << ENET_TXVLANFRAMES_G_FRMCNT_SHIFT) & ENET_TXVLANFRAMES_G_FRMCNT_MASK)
#define ENET_TXVLANFRAMES_G_FRMCNT_GET(x) (((uint32_t)(x) & ENET_TXVLANFRAMES_G_FRMCNT_MASK) >> ENET_TXVLANFRAMES_G_FRMCNT_SHIFT)

/* Bitfield definition for register: TXOVERSIZE_G */
/*
 * FRMCNT (rw)
 *
 * Number of frames transmitted without errors and with length greater than the maxsize (1,518 or 1,522 bytes for VLAN tagged frames; 2000 bytes if enabled in Bit 27 of Register 0 (MAC Configuration Register)).
 */
#define ENET_TXOVERSIZE_G_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_TXOVERSIZE_G_FRMCNT_SHIFT (0U)
#define ENET_TXOVERSIZE_G_FRMCNT_SET(x) (((uint32_t)(x) << ENET_TXOVERSIZE_G_FRMCNT_SHIFT) & ENET_TXOVERSIZE_G_FRMCNT_MASK)
#define ENET_TXOVERSIZE_G_FRMCNT_GET(x) (((uint32_t)(x) & ENET_TXOVERSIZE_G_FRMCNT_MASK) >> ENET_TXOVERSIZE_G_FRMCNT_SHIFT)

/* Bitfield definition for register: RXFRAMECOUNT_GB */
/*
 * FRMCNT (rw)
 *
 * Number of good and bad frames received.
 */
#define ENET_RXFRAMECOUNT_GB_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXFRAMECOUNT_GB_FRMCNT_SHIFT (0U)
#define ENET_RXFRAMECOUNT_GB_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXFRAMECOUNT_GB_FRMCNT_SHIFT) & ENET_RXFRAMECOUNT_GB_FRMCNT_MASK)
#define ENET_RXFRAMECOUNT_GB_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXFRAMECOUNT_GB_FRMCNT_MASK) >> ENET_RXFRAMECOUNT_GB_FRMCNT_SHIFT)

/* Bitfield definition for register: RXOCTETCOUNT_G */
/*
 * BYTECNT (rw)
 *
 * Number of bytes received, exclusive of preamble, in good and bad frames.
 */
#define ENET_RXOCTETCOUNT_G_BYTECNT_MASK (0xFFFFFFFFUL)
#define ENET_RXOCTETCOUNT_G_BYTECNT_SHIFT (0U)
#define ENET_RXOCTETCOUNT_G_BYTECNT_SET(x) (((uint32_t)(x) << ENET_RXOCTETCOUNT_G_BYTECNT_SHIFT) & ENET_RXOCTETCOUNT_G_BYTECNT_MASK)
#define ENET_RXOCTETCOUNT_G_BYTECNT_GET(x) (((uint32_t)(x) & ENET_RXOCTETCOUNT_G_BYTECNT_MASK) >> ENET_RXOCTETCOUNT_G_BYTECNT_SHIFT)

