hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/* Bitfield definition for register: RXOCTETCOUNT_GB */
/*
 * BYTECNT (rw)
 *
 * Number of bytes received, exclusive of preamble, only in good frames.
 */
#define ENET_RXOCTETCOUNT_GB_BYTECNT_MASK (0xFFFFFFFFUL)
#define ENET_RXOCTETCOUNT_GB_BYTECNT_SHIFT (0U)
#define ENET_RXOCTETCOUNT_GB_BYTECNT_SET(x) (((uint32_t)(x) << ENET_RXOCTETCOUNT_GB_BYTECNT_SHIFT) & ENET_RXOCTETCOUNT_GB_BYTECNT_MASK)
#define ENET_RXOCTETCOUNT_GB_BYTECNT_GET(x) (((uint32_t)(x) & ENET_RXOCTETCOUNT_GB_BYTECNT_MASK) >> ENET_RXOCTETCOUNT_GB_BYTECNT_SHIFT)

/* Bitfield definition for register: RXBROADCASTFRAMES_G */
/*
 * FRMCNT (rw)
 *
 * Number of good broadcast frames received.
 */
#define ENET_RXBROADCASTFRAMES_G_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXBROADCASTFRAMES_G_FRMCNT_SHIFT (0U)
#define ENET_RXBROADCASTFRAMES_G_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXBROADCASTFRAMES_G_FRMCNT_SHIFT) & ENET_RXBROADCASTFRAMES_G_FRMCNT_MASK)
#define ENET_RXBROADCASTFRAMES_G_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXBROADCASTFRAMES_G_FRMCNT_MASK) >> ENET_RXBROADCASTFRAMES_G_FRMCNT_SHIFT)

/* Bitfield definition for register: RXMULTICASTFRAMES_G */
/*
 * FRMCNT (rw)
 *
 * Number of good multicast frames received.
 */
#define ENET_RXMULTICASTFRAMES_G_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXMULTICASTFRAMES_G_FRMCNT_SHIFT (0U)
#define ENET_RXMULTICASTFRAMES_G_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXMULTICASTFRAMES_G_FRMCNT_SHIFT) & ENET_RXMULTICASTFRAMES_G_FRMCNT_MASK)
#define ENET_RXMULTICASTFRAMES_G_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXMULTICASTFRAMES_G_FRMCNT_MASK) >> ENET_RXMULTICASTFRAMES_G_FRMCNT_SHIFT)

/* Bitfield definition for register: RXCRCERROR */
/*
 * FRMCNT (rw)
 *
 * Number of frames received with CRC error.
 */
#define ENET_RXCRCERROR_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXCRCERROR_FRMCNT_SHIFT (0U)
#define ENET_RXCRCERROR_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXCRCERROR_FRMCNT_SHIFT) & ENET_RXCRCERROR_FRMCNT_MASK)
#define ENET_RXCRCERROR_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXCRCERROR_FRMCNT_MASK) >> ENET_RXCRCERROR_FRMCNT_SHIFT)

/* Bitfield definition for register: RXALIGNMENTERROR */
/*
 * FRMCNT (rw)
 *
 * Number of frames received with alignment (dribble) error. Valid only in 10/100 mode.
 */
#define ENET_RXALIGNMENTERROR_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXALIGNMENTERROR_FRMCNT_SHIFT (0U)
#define ENET_RXALIGNMENTERROR_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXALIGNMENTERROR_FRMCNT_SHIFT) & ENET_RXALIGNMENTERROR_FRMCNT_MASK)
#define ENET_RXALIGNMENTERROR_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXALIGNMENTERROR_FRMCNT_MASK) >> ENET_RXALIGNMENTERROR_FRMCNT_SHIFT)

/* Bitfield definition for register: RXRUNTERROR */
/*
 * FRMCNT (rw)
 *
 * Number of frames received with runt (<64 bytes and CRC error) error.
 */
#define ENET_RXRUNTERROR_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXRUNTERROR_FRMCNT_SHIFT (0U)
#define ENET_RXRUNTERROR_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXRUNTERROR_FRMCNT_SHIFT) & ENET_RXRUNTERROR_FRMCNT_MASK)
#define ENET_RXRUNTERROR_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXRUNTERROR_FRMCNT_MASK) >> ENET_RXRUNTERROR_FRMCNT_SHIFT)

/* Bitfield definition for register: RXJABBERERROR */
/*
 * FRMCNT (rw)
 *
 * Number of giant frames received with length (including CRC) greater than 1,518 bytes (1,522 bytes for VLAN tagged) and with CRC error. If Jumbo Frame mode is enabled, then frames of length greater than 9,018 bytes (9,022 for VLAN tagged) are considered as giant frames.
 */
#define ENET_RXJABBERERROR_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXJABBERERROR_FRMCNT_SHIFT (0U)
#define ENET_RXJABBERERROR_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXJABBERERROR_FRMCNT_SHIFT) & ENET_RXJABBERERROR_FRMCNT_MASK)
#define ENET_RXJABBERERROR_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXJABBERERROR_FRMCNT_MASK) >> ENET_RXJABBERERROR_FRMCNT_SHIFT)

/* Bitfield definition for register: RXUNDERSIZE_G */
/*
 * FRMCNT (rw)
 *
 * Number of frames received with length less than 64 bytes, without any errors.
 */
#define ENET_RXUNDERSIZE_G_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXUNDERSIZE_G_FRMCNT_SHIFT (0U)
#define ENET_RXUNDERSIZE_G_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXUNDERSIZE_G_FRMCNT_SHIFT) & ENET_RXUNDERSIZE_G_FRMCNT_MASK)
#define ENET_RXUNDERSIZE_G_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXUNDERSIZE_G_FRMCNT_MASK) >> ENET_RXUNDERSIZE_G_FRMCNT_SHIFT)

/* Bitfield definition for register: RXOVERSIZE_G */
/*
 * FRMCNT (rw)
 *
 * Number of frames received without errors, with length greater than the maxsize (1,518 or 1,522 for VLAN tagged frames; 2,000 bytes if enabled in Bit 27 of Register 0 (MAC Configuration Register)).
 */
#define ENET_RXOVERSIZE_G_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXOVERSIZE_G_FRMCNT_SHIFT (0U)
#define ENET_RXOVERSIZE_G_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXOVERSIZE_G_FRMCNT_SHIFT) & ENET_RXOVERSIZE_G_FRMCNT_MASK)
#define ENET_RXOVERSIZE_G_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXOVERSIZE_G_FRMCNT_MASK) >> ENET_RXOVERSIZE_G_FRMCNT_SHIFT)

/* Bitfield definition for register: RX64OCTETS_GB */
/*
 * FRMCNT (rw)
 *
 * Number of good and bad frames received with length 64 bytes, exclusive of preamble.
 */
#define ENET_RX64OCTETS_GB_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RX64OCTETS_GB_FRMCNT_SHIFT (0U)
#define ENET_RX64OCTETS_GB_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RX64OCTETS_GB_FRMCNT_SHIFT) & ENET_RX64OCTETS_GB_FRMCNT_MASK)
#define ENET_RX64OCTETS_GB_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RX64OCTETS_GB_FRMCNT_MASK) >> ENET_RX64OCTETS_GB_FRMCNT_SHIFT)

/* Bitfield definition for register: RX65TO127OCTETS_GB */
/*
 * FRMCNT (rw)
 *
 * Number of good and bad frames received with length between 65 and 127 (inclusive) bytes, exclusive of preamble.
 */
#define ENET_RX65TO127OCTETS_GB_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RX65TO127OCTETS_GB_FRMCNT_SHIFT (0U)
#define ENET_RX65TO127OCTETS_GB_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RX65TO127OCTETS_GB_FRMCNT_SHIFT) & ENET_RX65TO127OCTETS_GB_FRMCNT_MASK)
#define ENET_RX65TO127OCTETS_GB_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RX65TO127OCTETS_GB_FRMCNT_MASK) >> ENET_RX65TO127OCTETS_GB_FRMCNT_SHIFT)

/* Bitfield definition for register: RX128TO255OCTETS_GB */
/*
 * FRMCNT (rw)
 *
 * Number of good and bad frames received with length between 128 and 255 (inclusive) bytes, exclusive of preamble.
 */
#define ENET_RX128TO255OCTETS_GB_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RX128TO255OCTETS_GB_FRMCNT_SHIFT (0U)
#define ENET_RX128TO255OCTETS_GB_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RX128TO255OCTETS_GB_FRMCNT_SHIFT) & ENET_RX128TO255OCTETS_GB_FRMCNT_MASK)
#define ENET_RX128TO255OCTETS_GB_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RX128TO255OCTETS_GB_FRMCNT_MASK) >> ENET_RX128TO255OCTETS_GB_FRMCNT_SHIFT)

/* Bitfield definition for register: RX256TO511OCTETS_GB */
/*
 * FRMCNT (rw)
 *
 * Number of good and bad frames received with length between 256 and 511 (inclusive) bytes, exclusive of preamble.
 */
#define ENET_RX256TO511OCTETS_GB_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RX256TO511OCTETS_GB_FRMCNT_SHIFT (0U)
#define ENET_RX256TO511OCTETS_GB_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RX256TO511OCTETS_GB_FRMCNT_SHIFT) & ENET_RX256TO511OCTETS_GB_FRMCNT_MASK)
#define ENET_RX256TO511OCTETS_GB_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RX256TO511OCTETS_GB_FRMCNT_MASK) >> ENET_RX256TO511OCTETS_GB_FRMCNT_SHIFT)

/* Bitfield definition for register: RX512TO1023OCTETS_GB */
/*
 * FRMCNT (rw)
 *
 * Number of good and bad frames received with length between 512 and 1,023 (inclusive) bytes, exclusive of preamble.
 */
#define ENET_RX512TO1023OCTETS_GB_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RX512TO1023OCTETS_GB_FRMCNT_SHIFT (0U)
#define ENET_RX512TO1023OCTETS_GB_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RX512TO1023OCTETS_GB_FRMCNT_SHIFT) & ENET_RX512TO1023OCTETS_GB_FRMCNT_MASK)
#define ENET_RX512TO1023OCTETS_GB_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RX512TO1023OCTETS_GB_FRMCNT_MASK) >> ENET_RX512TO1023OCTETS_GB_FRMCNT_SHIFT)

