hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/* Bitfield definition for register: RX1024TOMAXOCTETS_GB */
/*
 * FRMCNT (rw)
 *
 * Number of good and bad frames received with length between 1,024 and maxsize (inclusive) bytes, exclusive of preamble and retried frames.
 */
#define ENET_RX1024TOMAXOCTETS_GB_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RX1024TOMAXOCTETS_GB_FRMCNT_SHIFT (0U)
#define ENET_RX1024TOMAXOCTETS_GB_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RX1024TOMAXOCTETS_GB_FRMCNT_SHIFT) & ENET_RX1024TOMAXOCTETS_GB_FRMCNT_MASK)
#define ENET_RX1024TOMAXOCTETS_GB_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RX1024TOMAXOCTETS_GB_FRMCNT_MASK) >> ENET_RX1024TOMAXOCTETS_GB_FRMCNT_SHIFT)

/* Bitfield definition for register: RXUNICASTFRAMES_G */
/*
 * FRMCNT (rw)
 *
 * Number of received good unicast frames.
 */
#define ENET_RXUNICASTFRAMES_G_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXUNICASTFRAMES_G_FRMCNT_SHIFT (0U)
#define ENET_RXUNICASTFRAMES_G_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXUNICASTFRAMES_G_FRMCNT_SHIFT) & ENET_RXUNICASTFRAMES_G_FRMCNT_MASK)
#define ENET_RXUNICASTFRAMES_G_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXUNICASTFRAMES_G_FRMCNT_MASK) >> ENET_RXUNICASTFRAMES_G_FRMCNT_SHIFT)

/* Bitfield definition for register: RXLENGTHERROR */
/*
 * FRMCNT (rw)
 *
 * Number of frames received with length error (Length type field ≠ frame size), for all frames with valid length field.
 */
#define ENET_RXLENGTHERROR_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXLENGTHERROR_FRMCNT_SHIFT (0U)
#define ENET_RXLENGTHERROR_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXLENGTHERROR_FRMCNT_SHIFT) & ENET_RXLENGTHERROR_FRMCNT_MASK)
#define ENET_RXLENGTHERROR_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXLENGTHERROR_FRMCNT_MASK) >> ENET_RXLENGTHERROR_FRMCNT_SHIFT)

/* Bitfield definition for register: RXOUTOFRANGETYPE */
/*
 * FRMCNT (rw)
 *
 * Number of frames received with length field not equal to the valid frame size (greater than 1,500 but less than 1,536).
 */
#define ENET_RXOUTOFRANGETYPE_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXOUTOFRANGETYPE_FRMCNT_SHIFT (0U)
#define ENET_RXOUTOFRANGETYPE_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXOUTOFRANGETYPE_FRMCNT_SHIFT) & ENET_RXOUTOFRANGETYPE_FRMCNT_MASK)
#define ENET_RXOUTOFRANGETYPE_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXOUTOFRANGETYPE_FRMCNT_MASK) >> ENET_RXOUTOFRANGETYPE_FRMCNT_SHIFT)

/* Bitfield definition for register: RXPAUSEFRAMES */
/*
 * FRMCNT (rw)
 *
 * Number of good and valid Pause frames received.
 */
#define ENET_RXPAUSEFRAMES_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXPAUSEFRAMES_FRMCNT_SHIFT (0U)
#define ENET_RXPAUSEFRAMES_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXPAUSEFRAMES_FRMCNT_SHIFT) & ENET_RXPAUSEFRAMES_FRMCNT_MASK)
#define ENET_RXPAUSEFRAMES_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXPAUSEFRAMES_FRMCNT_MASK) >> ENET_RXPAUSEFRAMES_FRMCNT_SHIFT)

/* Bitfield definition for register: RXFIFOOVERFLOW */
/*
 * FRMCNT (rw)
 *
 * Number of missed received frames because of FIFO overflow. This counter is not present in the GMAC-CORE configuration.
 */
#define ENET_RXFIFOOVERFLOW_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXFIFOOVERFLOW_FRMCNT_SHIFT (0U)
#define ENET_RXFIFOOVERFLOW_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXFIFOOVERFLOW_FRMCNT_SHIFT) & ENET_RXFIFOOVERFLOW_FRMCNT_MASK)
#define ENET_RXFIFOOVERFLOW_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXFIFOOVERFLOW_FRMCNT_MASK) >> ENET_RXFIFOOVERFLOW_FRMCNT_SHIFT)

/* Bitfield definition for register: RXVLANFRAMES_GB */
/*
 * FRMCNT (rw)
 *
 * Number of good and bad VLAN frames received.
 */
#define ENET_RXVLANFRAMES_GB_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXVLANFRAMES_GB_FRMCNT_SHIFT (0U)
#define ENET_RXVLANFRAMES_GB_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXVLANFRAMES_GB_FRMCNT_SHIFT) & ENET_RXVLANFRAMES_GB_FRMCNT_MASK)
#define ENET_RXVLANFRAMES_GB_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXVLANFRAMES_GB_FRMCNT_MASK) >> ENET_RXVLANFRAMES_GB_FRMCNT_SHIFT)

/* Bitfield definition for register: RXWATCHDOGERROR */
/*
 * FRMCNT (rw)
 *
 * Number of frames received with error because of watchdog timeout error (frames with a data load larger than 2,048 bytes or the value programmed in Register 55 (Watchdog Timeout Register)).
 */
#define ENET_RXWATCHDOGERROR_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXWATCHDOGERROR_FRMCNT_SHIFT (0U)
#define ENET_RXWATCHDOGERROR_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXWATCHDOGERROR_FRMCNT_SHIFT) & ENET_RXWATCHDOGERROR_FRMCNT_MASK)
#define ENET_RXWATCHDOGERROR_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXWATCHDOGERROR_FRMCNT_MASK) >> ENET_RXWATCHDOGERROR_FRMCNT_SHIFT)

/* Bitfield definition for register: RXRCVERROR */
/*
 * FRMCNT (rw)
 *
 * Number of frames received with Receive error or Frame Extension error on the GMII or MII interface.
 */
#define ENET_RXRCVERROR_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXRCVERROR_FRMCNT_SHIFT (0U)
#define ENET_RXRCVERROR_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXRCVERROR_FRMCNT_SHIFT) & ENET_RXRCVERROR_FRMCNT_MASK)
#define ENET_RXRCVERROR_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXRCVERROR_FRMCNT_MASK) >> ENET_RXRCVERROR_FRMCNT_SHIFT)

/* Bitfield definition for register: RXCTRLFRAMES_G */
/*
 * FRMCNT (rw)
 *
 * Number of received good control frames.
 */
#define ENET_RXCTRLFRAMES_G_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXCTRLFRAMES_G_FRMCNT_SHIFT (0U)
#define ENET_RXCTRLFRAMES_G_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXCTRLFRAMES_G_FRMCNT_SHIFT) & ENET_RXCTRLFRAMES_G_FRMCNT_MASK)
#define ENET_RXCTRLFRAMES_G_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXCTRLFRAMES_G_FRMCNT_MASK) >> ENET_RXCTRLFRAMES_G_FRMCNT_SHIFT)

/* Bitfield definition for register: MMC_IPC_INTR_MASK_RX */
/*
 * RXICMPEROIM (rw)
 *
 * MMC Receive ICMP Error Octet Counter Interrupt Mask
 * Setting this bit masks the interrupt when the rxicmp_err_octets counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_MASK_RX_RXICMPEROIM_MASK (0x20000000UL)
#define ENET_MMC_IPC_INTR_MASK_RX_RXICMPEROIM_SHIFT (29U)
#define ENET_MMC_IPC_INTR_MASK_RX_RXICMPEROIM_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_MASK_RX_RXICMPEROIM_SHIFT) & ENET_MMC_IPC_INTR_MASK_RX_RXICMPEROIM_MASK)
#define ENET_MMC_IPC_INTR_MASK_RX_RXICMPEROIM_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_MASK_RX_RXICMPEROIM_MASK) >> ENET_MMC_IPC_INTR_MASK_RX_RXICMPEROIM_SHIFT)

