hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/* Bitfield definition for register: RXIPV4_UDSBL_FRMS */
/*
 * FRMCNT (rw)
 *
 * Number of good IPv4 datagrams received that had a UDP payload with checksum disabled
 */
#define ENET_RXIPV4_UDSBL_FRMS_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXIPV4_UDSBL_FRMS_FRMCNT_SHIFT (0U)
#define ENET_RXIPV4_UDSBL_FRMS_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXIPV4_UDSBL_FRMS_FRMCNT_SHIFT) & ENET_RXIPV4_UDSBL_FRMS_FRMCNT_MASK)
#define ENET_RXIPV4_UDSBL_FRMS_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXIPV4_UDSBL_FRMS_FRMCNT_MASK) >> ENET_RXIPV4_UDSBL_FRMS_FRMCNT_SHIFT)

/* Bitfield definition for register: RXIPV6_GD_FRMS */
/*
 * FRMCNT (rw)
 *
 * Number of good IPv6 datagrams received with TCP, UDP, or ICMP payloads
 */
#define ENET_RXIPV6_GD_FRMS_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXIPV6_GD_FRMS_FRMCNT_SHIFT (0U)
#define ENET_RXIPV6_GD_FRMS_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXIPV6_GD_FRMS_FRMCNT_SHIFT) & ENET_RXIPV6_GD_FRMS_FRMCNT_MASK)
#define ENET_RXIPV6_GD_FRMS_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXIPV6_GD_FRMS_FRMCNT_MASK) >> ENET_RXIPV6_GD_FRMS_FRMCNT_SHIFT)

/* Bitfield definition for register: RXIPV6_HDRERR_FRMS */
/*
 * FRMCNT (rw)
 *
 * Number of IPv6 datagrams received with header errors (length or version mismatch)
 */
#define ENET_RXIPV6_HDRERR_FRMS_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXIPV6_HDRERR_FRMS_FRMCNT_SHIFT (0U)
#define ENET_RXIPV6_HDRERR_FRMS_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXIPV6_HDRERR_FRMS_FRMCNT_SHIFT) & ENET_RXIPV6_HDRERR_FRMS_FRMCNT_MASK)
#define ENET_RXIPV6_HDRERR_FRMS_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXIPV6_HDRERR_FRMS_FRMCNT_MASK) >> ENET_RXIPV6_HDRERR_FRMS_FRMCNT_SHIFT)

/* Bitfield definition for register: RXIPV6_NOPAY_FRMS */
/*
 * FRMCNT (rw)
 *
 * Number of IPv6 datagram frames received that did not have a TCP, UDP, or ICMP payload. This includes all IPv6 datagrams with fragmentation or security extension headers
 */
#define ENET_RXIPV6_NOPAY_FRMS_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXIPV6_NOPAY_FRMS_FRMCNT_SHIFT (0U)
#define ENET_RXIPV6_NOPAY_FRMS_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXIPV6_NOPAY_FRMS_FRMCNT_SHIFT) & ENET_RXIPV6_NOPAY_FRMS_FRMCNT_MASK)
#define ENET_RXIPV6_NOPAY_FRMS_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXIPV6_NOPAY_FRMS_FRMCNT_MASK) >> ENET_RXIPV6_NOPAY_FRMS_FRMCNT_SHIFT)

/* Bitfield definition for register: RXUDP_GD_FRMS */
/*
 * FRMCNT (rw)
 *
 * Number of good IP datagrams with a good UDP payload. This counter is not updated when the rxipv4_udsbl_frms counter is incremented.
 */
#define ENET_RXUDP_GD_FRMS_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXUDP_GD_FRMS_FRMCNT_SHIFT (0U)
#define ENET_RXUDP_GD_FRMS_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXUDP_GD_FRMS_FRMCNT_SHIFT) & ENET_RXUDP_GD_FRMS_FRMCNT_MASK)
#define ENET_RXUDP_GD_FRMS_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXUDP_GD_FRMS_FRMCNT_MASK) >> ENET_RXUDP_GD_FRMS_FRMCNT_SHIFT)

/* Bitfield definition for register: RXUDP_ERR_FRMS */
/*
 * FRMCNT (rw)
 *
 * Number of good IP datagrams whose UDP payload has a checksum error
 */
#define ENET_RXUDP_ERR_FRMS_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXUDP_ERR_FRMS_FRMCNT_SHIFT (0U)
#define ENET_RXUDP_ERR_FRMS_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXUDP_ERR_FRMS_FRMCNT_SHIFT) & ENET_RXUDP_ERR_FRMS_FRMCNT_MASK)
#define ENET_RXUDP_ERR_FRMS_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXUDP_ERR_FRMS_FRMCNT_MASK) >> ENET_RXUDP_ERR_FRMS_FRMCNT_SHIFT)

/* Bitfield definition for register: RXTCP_GD_FRMS */
/*
 * FRMCNT (rw)
 *
 * Number of good IP datagrams with a good TCP payload
 */
#define ENET_RXTCP_GD_FRMS_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXTCP_GD_FRMS_FRMCNT_SHIFT (0U)
#define ENET_RXTCP_GD_FRMS_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXTCP_GD_FRMS_FRMCNT_SHIFT) & ENET_RXTCP_GD_FRMS_FRMCNT_MASK)
#define ENET_RXTCP_GD_FRMS_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXTCP_GD_FRMS_FRMCNT_MASK) >> ENET_RXTCP_GD_FRMS_FRMCNT_SHIFT)

/* Bitfield definition for register: RXTCP_ERR_FRMS */
/*
 * FRMCNT (rw)
 *
 * Number of good IP datagrams whose TCP payload has a checksum error
 */
#define ENET_RXTCP_ERR_FRMS_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXTCP_ERR_FRMS_FRMCNT_SHIFT (0U)
#define ENET_RXTCP_ERR_FRMS_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXTCP_ERR_FRMS_FRMCNT_SHIFT) & ENET_RXTCP_ERR_FRMS_FRMCNT_MASK)
#define ENET_RXTCP_ERR_FRMS_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXTCP_ERR_FRMS_FRMCNT_MASK) >> ENET_RXTCP_ERR_FRMS_FRMCNT_SHIFT)

/* Bitfield definition for register: RXICMP_GD_FRMS */
/*
 * FRMCNT (rw)
 *
 * Number of good IP datagrams with a good ICMP payload
 */
#define ENET_RXICMP_GD_FRMS_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXICMP_GD_FRMS_FRMCNT_SHIFT (0U)
#define ENET_RXICMP_GD_FRMS_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXICMP_GD_FRMS_FRMCNT_SHIFT) & ENET_RXICMP_GD_FRMS_FRMCNT_MASK)
#define ENET_RXICMP_GD_FRMS_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXICMP_GD_FRMS_FRMCNT_MASK) >> ENET_RXICMP_GD_FRMS_FRMCNT_SHIFT)

/* Bitfield definition for register: RXICMP_ERR_FRMS */
/*
 * FRMCNT (rw)
 *
 * Number of good IP datagrams whose ICMP payload has a checksum error
 */
#define ENET_RXICMP_ERR_FRMS_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXICMP_ERR_FRMS_FRMCNT_SHIFT (0U)
#define ENET_RXICMP_ERR_FRMS_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXICMP_ERR_FRMS_FRMCNT_SHIFT) & ENET_RXICMP_ERR_FRMS_FRMCNT_MASK)
#define ENET_RXICMP_ERR_FRMS_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXICMP_ERR_FRMS_FRMCNT_MASK) >> ENET_RXICMP_ERR_FRMS_FRMCNT_SHIFT)

/* Bitfield definition for register: RXIPV4_GD_OCTETS */
/*
 * BYTECNT (rw)
 *
 * Number of bytes received in good IPv4 datagrams encapsulating TCP, UDP, or ICMP data. (Ethernet header, FCS, pad, or IP pad bytes are not included in this counter or in the octet counters listed below).
 */
#define ENET_RXIPV4_GD_OCTETS_BYTECNT_MASK (0xFFFFFFFFUL)
#define ENET_RXIPV4_GD_OCTETS_BYTECNT_SHIFT (0U)
#define ENET_RXIPV4_GD_OCTETS_BYTECNT_SET(x) (((uint32_t)(x) << ENET_RXIPV4_GD_OCTETS_BYTECNT_SHIFT) & ENET_RXIPV4_GD_OCTETS_BYTECNT_MASK)
#define ENET_RXIPV4_GD_OCTETS_BYTECNT_GET(x) (((uint32_t)(x) & ENET_RXIPV4_GD_OCTETS_BYTECNT_MASK) >> ENET_RXIPV4_GD_OCTETS_BYTECNT_SHIFT)

/* Bitfield definition for register: RXIPV4_HDRERR_OCTETS */
/*
 * BYTECNT (rw)
 *
 * Number of bytes received in IPv4 datagrams with header errors (checksum, length, version mismatch). The value in the Length field of IPv4 header is used to update this counter.
 */
#define ENET_RXIPV4_HDRERR_OCTETS_BYTECNT_MASK (0xFFFFFFFFUL)
#define ENET_RXIPV4_HDRERR_OCTETS_BYTECNT_SHIFT (0U)
#define ENET_RXIPV4_HDRERR_OCTETS_BYTECNT_SET(x) (((uint32_t)(x) << ENET_RXIPV4_HDRERR_OCTETS_BYTECNT_SHIFT) & ENET_RXIPV4_HDRERR_OCTETS_BYTECNT_MASK)
#define ENET_RXIPV4_HDRERR_OCTETS_BYTECNT_GET(x) (((uint32_t)(x) & ENET_RXIPV4_HDRERR_OCTETS_BYTECNT_MASK) >> ENET_RXIPV4_HDRERR_OCTETS_BYTECNT_SHIFT)

/* Bitfield definition for register: RXIPV4_NOPAY_OCTETS */
/*
 * BYTECNT (rw)
 *
 * Number of bytes received in IPv4 datagrams that did not have a TCP, UDP, or ICMP payload. The value in the IPv4 header’s Length field is used to update this counter.
 */
#define ENET_RXIPV4_NOPAY_OCTETS_BYTECNT_MASK (0xFFFFFFFFUL)
#define ENET_RXIPV4_NOPAY_OCTETS_BYTECNT_SHIFT (0U)
#define ENET_RXIPV4_NOPAY_OCTETS_BYTECNT_SET(x) (((uint32_t)(x) << ENET_RXIPV4_NOPAY_OCTETS_BYTECNT_SHIFT) & ENET_RXIPV4_NOPAY_OCTETS_BYTECNT_MASK)
#define ENET_RXIPV4_NOPAY_OCTETS_BYTECNT_GET(x) (((uint32_t)(x) & ENET_RXIPV4_NOPAY_OCTETS_BYTECNT_MASK) >> ENET_RXIPV4_NOPAY_OCTETS_BYTECNT_SHIFT)

