hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/* Bitfield definition for register: AUX_TS_NSEC */
/*
 * AUXTSLO (rw)
 *
 * Contains the lower 31 bits (nano-seconds field) of the auxiliary timestamp.
 */
#define ENET_AUX_TS_NSEC_AUXTSLO_MASK (0x7FFFFFFFUL)
#define ENET_AUX_TS_NSEC_AUXTSLO_SHIFT (0U)
#define ENET_AUX_TS_NSEC_AUXTSLO_SET(x) (((uint32_t)(x) << ENET_AUX_TS_NSEC_AUXTSLO_SHIFT) & ENET_AUX_TS_NSEC_AUXTSLO_MASK)
#define ENET_AUX_TS_NSEC_AUXTSLO_GET(x) (((uint32_t)(x) & ENET_AUX_TS_NSEC_AUXTSLO_MASK) >> ENET_AUX_TS_NSEC_AUXTSLO_SHIFT)

/* Bitfield definition for register: AUX_TS_SEC */
/*
 * AUXTSHI (rw)
 *
 * Contains the lower 32 bits of the Seconds field of the auxiliary timestamp.
 */
#define ENET_AUX_TS_SEC_AUXTSHI_MASK (0xFFFFFFFFUL)
#define ENET_AUX_TS_SEC_AUXTSHI_SHIFT (0U)
#define ENET_AUX_TS_SEC_AUXTSHI_SET(x) (((uint32_t)(x) << ENET_AUX_TS_SEC_AUXTSHI_SHIFT) & ENET_AUX_TS_SEC_AUXTSHI_MASK)
#define ENET_AUX_TS_SEC_AUXTSHI_GET(x) (((uint32_t)(x) & ENET_AUX_TS_SEC_AUXTSHI_MASK) >> ENET_AUX_TS_SEC_AUXTSHI_SHIFT)

/* Bitfield definition for register: PPS0_INTERVAL */
/*
 * PPSINT (rw)
 *
 * PPS0 Output Signal Interval
 * These bits store the interval between the rising edges of PPS0 signal output in terms of units of sub-second increment value. You need to program one value less than the required interval. For example, if the PTP reference clock is 50 MHz (period of 20ns), and desired interval between rising edges of PPS0 signal output is 100ns (that is, five units of sub-second increment value), then you should program value 4 (5 – 1) in this register.
 */
#define ENET_PPS0_INTERVAL_PPSINT_MASK (0xFFFFFFFFUL)
#define ENET_PPS0_INTERVAL_PPSINT_SHIFT (0U)
#define ENET_PPS0_INTERVAL_PPSINT_SET(x) (((uint32_t)(x) << ENET_PPS0_INTERVAL_PPSINT_SHIFT) & ENET_PPS0_INTERVAL_PPSINT_MASK)
#define ENET_PPS0_INTERVAL_PPSINT_GET(x) (((uint32_t)(x) & ENET_PPS0_INTERVAL_PPSINT_MASK) >> ENET_PPS0_INTERVAL_PPSINT_SHIFT)

/* Bitfield definition for register: PPS0_WIDTH */
/*
 * PPSWIDTH (rw)
 *
 * PPS0 Output Signal Width
 * These bits store the width between the rising edge and corresponding falling edge of the PPS0 signal output in terms of units of sub-second increment value. You need to program one value less than the required interval. For example, if PTP reference clock is 50 MHz (period of 20ns), and desired width between the rising and corresponding falling edges of PPS0 signal output is 80ns (that is, four units of sub-second increment value), then you should program value 3 (4 – 1) in this register.
 */
#define ENET_PPS0_WIDTH_PPSWIDTH_MASK (0xFFFFFFFFUL)
#define ENET_PPS0_WIDTH_PPSWIDTH_SHIFT (0U)
#define ENET_PPS0_WIDTH_PPSWIDTH_SET(x) (((uint32_t)(x) << ENET_PPS0_WIDTH_PPSWIDTH_SHIFT) & ENET_PPS0_WIDTH_PPSWIDTH_MASK)
#define ENET_PPS0_WIDTH_PPSWIDTH_GET(x) (((uint32_t)(x) & ENET_PPS0_WIDTH_PPSWIDTH_MASK) >> ENET_PPS0_WIDTH_PPSWIDTH_SHIFT)

/* Bitfield definition for register of struct array PPS: TGTTM_SEC */
/*
 * TSTRH1 (rw)
 *
 * PPS1 Target Time Seconds Register
 * This register stores the time in seconds. When the timestamp value matches or exceeds both Target Timestamp registers, then based on Bits [14:13], TRGTMODSEL1, of Register 459 (PPS Control Register), the MAC starts or stops the PPS signal output and generates an interrupt (if enabled).
 */
#define ENET_PPS_TGTTM_SEC_TSTRH1_MASK (0xFFFFFFFFUL)
#define ENET_PPS_TGTTM_SEC_TSTRH1_SHIFT (0U)
#define ENET_PPS_TGTTM_SEC_TSTRH1_SET(x) (((uint32_t)(x) << ENET_PPS_TGTTM_SEC_TSTRH1_SHIFT) & ENET_PPS_TGTTM_SEC_TSTRH1_MASK)
#define ENET_PPS_TGTTM_SEC_TSTRH1_GET(x) (((uint32_t)(x) & ENET_PPS_TGTTM_SEC_TSTRH1_MASK) >> ENET_PPS_TGTTM_SEC_TSTRH1_SHIFT)

/* Bitfield definition for register of struct array PPS: TGTTM_NSEC */
/*
 * TRGTBUSY1 (rw)
 *
 * PPS1 Target Time Register Busy
 * The MAC sets this bit when the PPSCMD1 field (Bits [10:8]) in Register 459 (PPS Control Register) is programmed to 010 or 011. Programming the PPSCMD1 field to 010 or 011 instructs the MAC to synchronize the Target Time Registers to the PTP clock domain. The MAC clears this bit after synchronizing the Target Time Registers to the PTP clock domain The application must not update the Target Time Registers when this bit is read as 1. Otherwise, the synchronization of the previous programmed time gets corrupted.
 */
#define ENET_PPS_TGTTM_NSEC_TRGTBUSY1_MASK (0x80000000UL)
#define ENET_PPS_TGTTM_NSEC_TRGTBUSY1_SHIFT (31U)
#define ENET_PPS_TGTTM_NSEC_TRGTBUSY1_SET(x) (((uint32_t)(x) << ENET_PPS_TGTTM_NSEC_TRGTBUSY1_SHIFT) & ENET_PPS_TGTTM_NSEC_TRGTBUSY1_MASK)
#define ENET_PPS_TGTTM_NSEC_TRGTBUSY1_GET(x) (((uint32_t)(x) & ENET_PPS_TGTTM_NSEC_TRGTBUSY1_MASK) >> ENET_PPS_TGTTM_NSEC_TRGTBUSY1_SHIFT)

/*
 * TTSL1 (rw)
 *
 * Target Time Low for PPS1 Register
 * This register stores the time in (signed) nanoseconds. When the value of the timestamp matches the both Target Timestamp registers, then based on the TRGTMODSEL1 field (Bits [14:13]) in Register 459 (PPS Control Register), the MAC starts or stops the PPS signal output and generates an interrupt (if enabled). This value should not exceed 0x3B9A_C9FF when Bit 9 (TSCTRLSSR) is set in Register 448 (Timestamp Control Register). The actual start or stop time of the PPS signal output may have an error margin up to one unit of sub-second increment value.
 */
#define ENET_PPS_TGTTM_NSEC_TTSL1_MASK (0x7FFFFFFFUL)
#define ENET_PPS_TGTTM_NSEC_TTSL1_SHIFT (0U)
#define ENET_PPS_TGTTM_NSEC_TTSL1_SET(x) (((uint32_t)(x) << ENET_PPS_TGTTM_NSEC_TTSL1_SHIFT) & ENET_PPS_TGTTM_NSEC_TTSL1_MASK)
#define ENET_PPS_TGTTM_NSEC_TTSL1_GET(x) (((uint32_t)(x) & ENET_PPS_TGTTM_NSEC_TTSL1_MASK) >> ENET_PPS_TGTTM_NSEC_TTSL1_SHIFT)

/* Bitfield definition for register of struct array PPS: INTERVAL */
/*
 * PPSINT (rw)
 *
 * PPS1 Output Signal Interval
 * These bits store the interval between the rising edges of PPS1 signal output in terms of units of sub-second increment value. You need to program one value less than the required interval. For example, if the PTP reference clock is 50 MHz (period of 20ns), and desired interval between rising edges of PPS1 signal output is 100ns (that is, five units of sub-second increment value), then you should program value 4 (5 – 1) in this register.
 */
#define ENET_PPS_INTERVAL_PPSINT_MASK (0xFFFFFFFFUL)
#define ENET_PPS_INTERVAL_PPSINT_SHIFT (0U)
#define ENET_PPS_INTERVAL_PPSINT_SET(x) (((uint32_t)(x) << ENET_PPS_INTERVAL_PPSINT_SHIFT) & ENET_PPS_INTERVAL_PPSINT_MASK)
#define ENET_PPS_INTERVAL_PPSINT_GET(x) (((uint32_t)(x) & ENET_PPS_INTERVAL_PPSINT_MASK) >> ENET_PPS_INTERVAL_PPSINT_SHIFT)

/* Bitfield definition for register of struct array PPS: WIDTH */
/*
 * PPSWIDTH (rw)
 *
 * PPS1 Output Signal Width
 * These bits store the width between the rising edge and corresponding falling edge of the PPS1 signal output in terms of units of sub-second increment value. You need to program one value less than the required interval. For example, if PTP reference clock is 50 MHz (period of 20ns), and desired width between the rising and corresponding falling edges of PPS1 signal output is 80ns (that is, four units of sub-second increment value), then you should program value 3 (4 – 1) in this register.
 */
#define ENET_PPS_WIDTH_PPSWIDTH_MASK (0xFFFFFFFFUL)
#define ENET_PPS_WIDTH_PPSWIDTH_SHIFT (0U)
#define ENET_PPS_WIDTH_PPSWIDTH_SET(x) (((uint32_t)(x) << ENET_PPS_WIDTH_PPSWIDTH_SHIFT) & ENET_PPS_WIDTH_PPSWIDTH_MASK)
#define ENET_PPS_WIDTH_PPSWIDTH_GET(x) (((uint32_t)(x) & ENET_PPS_WIDTH_PPSWIDTH_MASK) >> ENET_PPS_WIDTH_PPSWIDTH_SHIFT)

/* Bitfield definition for register: DMA_BUS_MODE */
/*
 * RIB (rw)
 *
 * Rebuild INCRx Burst
 * When this bit is set high and the AHB master gets an EBT (Retry, Split, or Losing bus grant), the AHB master interface rebuilds the pending beats of any burst transfer initiated with INCRx. The AHB master interface rebuilds the beats with a combination of specified bursts with INCRx and SINGLE. By default, the AHB master interface rebuilds pending beats of an EBT with an unspecified (INCR) burst.
 */
#define ENET_DMA_BUS_MODE_RIB_MASK (0x80000000UL)
#define ENET_DMA_BUS_MODE_RIB_SHIFT (31U)
#define ENET_DMA_BUS_MODE_RIB_SET(x) (((uint32_t)(x) << ENET_DMA_BUS_MODE_RIB_SHIFT) & ENET_DMA_BUS_MODE_RIB_MASK)
#define ENET_DMA_BUS_MODE_RIB_GET(x) (((uint32_t)(x) & ENET_DMA_BUS_MODE_RIB_MASK) >> ENET_DMA_BUS_MODE_RIB_SHIFT)

