hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/*
 * AXWHSTS (rw)
 *
 * AXI Master Write Channel or AHB Master Status
 * When high, it indicates that AXI master's write channel is active and transferring data in the GMAC-AXI configuration. In the GMAC-AHB configuration, it indicates that the AHB master interface FSMs are in the non-idle state.
 */
#define ENET_DMA_BUS_STATUS_AXWHSTS_MASK (0x1U)
#define ENET_DMA_BUS_STATUS_AXWHSTS_SHIFT (0U)
#define ENET_DMA_BUS_STATUS_AXWHSTS_SET(x) (((uint32_t)(x) << ENET_DMA_BUS_STATUS_AXWHSTS_SHIFT) & ENET_DMA_BUS_STATUS_AXWHSTS_MASK)
#define ENET_DMA_BUS_STATUS_AXWHSTS_GET(x) (((uint32_t)(x) & ENET_DMA_BUS_STATUS_AXWHSTS_MASK) >> ENET_DMA_BUS_STATUS_AXWHSTS_SHIFT)

/* Bitfield definition for register: DMA_CURR_HOST_TX_DESC */
/*
 * CURTDESAPTR (rw)
 *
 * Host Transmit Descriptor Address Pointer
 * Cleared on Reset. Pointer updated by the DMA during operation.
 */
#define ENET_DMA_CURR_HOST_TX_DESC_CURTDESAPTR_MASK (0xFFFFFFFFUL)
#define ENET_DMA_CURR_HOST_TX_DESC_CURTDESAPTR_SHIFT (0U)
#define ENET_DMA_CURR_HOST_TX_DESC_CURTDESAPTR_SET(x) (((uint32_t)(x) << ENET_DMA_CURR_HOST_TX_DESC_CURTDESAPTR_SHIFT) & ENET_DMA_CURR_HOST_TX_DESC_CURTDESAPTR_MASK)
#define ENET_DMA_CURR_HOST_TX_DESC_CURTDESAPTR_GET(x) (((uint32_t)(x) & ENET_DMA_CURR_HOST_TX_DESC_CURTDESAPTR_MASK) >> ENET_DMA_CURR_HOST_TX_DESC_CURTDESAPTR_SHIFT)

/* Bitfield definition for register: DMA_CURR_HOST_RX_DESC */
/*
 * CURRDESAPTR (rw)
 *
 * Host Receive Descriptor Address Pointer
 * Cleared on Reset. Pointer updated by the DMA during operation.
 */
#define ENET_DMA_CURR_HOST_RX_DESC_CURRDESAPTR_MASK (0xFFFFFFFFUL)
#define ENET_DMA_CURR_HOST_RX_DESC_CURRDESAPTR_SHIFT (0U)
#define ENET_DMA_CURR_HOST_RX_DESC_CURRDESAPTR_SET(x) (((uint32_t)(x) << ENET_DMA_CURR_HOST_RX_DESC_CURRDESAPTR_SHIFT) & ENET_DMA_CURR_HOST_RX_DESC_CURRDESAPTR_MASK)
#define ENET_DMA_CURR_HOST_RX_DESC_CURRDESAPTR_GET(x) (((uint32_t)(x) & ENET_DMA_CURR_HOST_RX_DESC_CURRDESAPTR_MASK) >> ENET_DMA_CURR_HOST_RX_DESC_CURRDESAPTR_SHIFT)

/* Bitfield definition for register: DMA_CURR_HOST_TX_BUF */
/*
 * CURTBUFAPTR (rw)
 *
 * Host Transmit Buffer Address Pointer
 * Cleared on Reset. Pointer updated by the DMA during operation.
 */
#define ENET_DMA_CURR_HOST_TX_BUF_CURTBUFAPTR_MASK (0xFFFFFFFFUL)
#define ENET_DMA_CURR_HOST_TX_BUF_CURTBUFAPTR_SHIFT (0U)
#define ENET_DMA_CURR_HOST_TX_BUF_CURTBUFAPTR_SET(x) (((uint32_t)(x) << ENET_DMA_CURR_HOST_TX_BUF_CURTBUFAPTR_SHIFT) & ENET_DMA_CURR_HOST_TX_BUF_CURTBUFAPTR_MASK)
#define ENET_DMA_CURR_HOST_TX_BUF_CURTBUFAPTR_GET(x) (((uint32_t)(x) & ENET_DMA_CURR_HOST_TX_BUF_CURTBUFAPTR_MASK) >> ENET_DMA_CURR_HOST_TX_BUF_CURTBUFAPTR_SHIFT)

/* Bitfield definition for register: DMA_CURR_HOST_RX_BUF */
/*
 * CURRBUFAPTR (rw)
 *
 * Host Receive Buffer Address Pointer
 * Cleared on Reset. Pointer updated by the DMA during operation.
 */
#define ENET_DMA_CURR_HOST_RX_BUF_CURRBUFAPTR_MASK (0xFFFFFFFFUL)
#define ENET_DMA_CURR_HOST_RX_BUF_CURRBUFAPTR_SHIFT (0U)
#define ENET_DMA_CURR_HOST_RX_BUF_CURRBUFAPTR_SET(x) (((uint32_t)(x) << ENET_DMA_CURR_HOST_RX_BUF_CURRBUFAPTR_SHIFT) & ENET_DMA_CURR_HOST_RX_BUF_CURRBUFAPTR_MASK)
#define ENET_DMA_CURR_HOST_RX_BUF_CURRBUFAPTR_GET(x) (((uint32_t)(x) & ENET_DMA_CURR_HOST_RX_BUF_CURRBUFAPTR_MASK) >> ENET_DMA_CURR_HOST_RX_BUF_CURRBUFAPTR_SHIFT)

/* Bitfield definition for register: DMA_HW_FEATURE */
/*
 * ACTPHYIF (rw)
 *
 * Active or selected PHY interface
 * When you have multiple PHY interfaces in your configuration, this field indicates the sampled value of phy_intf_sel_i during reset de-assertion.
 * - 000: GMII or MII
 * - 001: RGMII
 * - 010: SGMII
 * - 011: TBI
 * - 100: RMII
 * - 101: RTBI
 * - 110: SMII
 * - 111: RevMII - All Others: Reserved
 */
#define ENET_DMA_HW_FEATURE_ACTPHYIF_MASK (0x70000000UL)
#define ENET_DMA_HW_FEATURE_ACTPHYIF_SHIFT (28U)
#define ENET_DMA_HW_FEATURE_ACTPHYIF_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_ACTPHYIF_SHIFT) & ENET_DMA_HW_FEATURE_ACTPHYIF_MASK)
#define ENET_DMA_HW_FEATURE_ACTPHYIF_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_ACTPHYIF_MASK) >> ENET_DMA_HW_FEATURE_ACTPHYIF_SHIFT)

/*
 * SAVLANINS (rw)
 *
 * Source Address or VLAN Insertion
 */
#define ENET_DMA_HW_FEATURE_SAVLANINS_MASK (0x8000000UL)
#define ENET_DMA_HW_FEATURE_SAVLANINS_SHIFT (27U)
#define ENET_DMA_HW_FEATURE_SAVLANINS_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_SAVLANINS_SHIFT) & ENET_DMA_HW_FEATURE_SAVLANINS_MASK)
#define ENET_DMA_HW_FEATURE_SAVLANINS_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_SAVLANINS_MASK) >> ENET_DMA_HW_FEATURE_SAVLANINS_SHIFT)

/*
 * FLEXIPPSEN (rw)
 *
 * Flexible Pulse-Per-Second Output
 */
#define ENET_DMA_HW_FEATURE_FLEXIPPSEN_MASK (0x4000000UL)
#define ENET_DMA_HW_FEATURE_FLEXIPPSEN_SHIFT (26U)
#define ENET_DMA_HW_FEATURE_FLEXIPPSEN_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_FLEXIPPSEN_SHIFT) & ENET_DMA_HW_FEATURE_FLEXIPPSEN_MASK)
#define ENET_DMA_HW_FEATURE_FLEXIPPSEN_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_FLEXIPPSEN_MASK) >> ENET_DMA_HW_FEATURE_FLEXIPPSEN_SHIFT)

/*
 * INTTSEN (rw)
 *
 * Timestamping with Internal System Time
 */
#define ENET_DMA_HW_FEATURE_INTTSEN_MASK (0x2000000UL)
#define ENET_DMA_HW_FEATURE_INTTSEN_SHIFT (25U)
#define ENET_DMA_HW_FEATURE_INTTSEN_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_INTTSEN_SHIFT) & ENET_DMA_HW_FEATURE_INTTSEN_MASK)
#define ENET_DMA_HW_FEATURE_INTTSEN_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_INTTSEN_MASK) >> ENET_DMA_HW_FEATURE_INTTSEN_SHIFT)

/*
 * ENHDESSEL (rw)
 *
 * Alternate (Enhanced Descriptor)
 */
#define ENET_DMA_HW_FEATURE_ENHDESSEL_MASK (0x1000000UL)
#define ENET_DMA_HW_FEATURE_ENHDESSEL_SHIFT (24U)
#define ENET_DMA_HW_FEATURE_ENHDESSEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_ENHDESSEL_SHIFT) & ENET_DMA_HW_FEATURE_ENHDESSEL_MASK)
#define ENET_DMA_HW_FEATURE_ENHDESSEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_ENHDESSEL_MASK) >> ENET_DMA_HW_FEATURE_ENHDESSEL_SHIFT)

/*
 * TXCHCNT (rw)
 *
 * Number of additional Tx Channels
 */
#define ENET_DMA_HW_FEATURE_TXCHCNT_MASK (0xC00000UL)
#define ENET_DMA_HW_FEATURE_TXCHCNT_SHIFT (22U)
#define ENET_DMA_HW_FEATURE_TXCHCNT_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_TXCHCNT_SHIFT) & ENET_DMA_HW_FEATURE_TXCHCNT_MASK)
#define ENET_DMA_HW_FEATURE_TXCHCNT_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_TXCHCNT_MASK) >> ENET_DMA_HW_FEATURE_TXCHCNT_SHIFT)

