hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/*
 * RXCHCNT (rw)
 *
 * Number of additional Rx Channels
 */
#define ENET_DMA_HW_FEATURE_RXCHCNT_MASK (0x300000UL)
#define ENET_DMA_HW_FEATURE_RXCHCNT_SHIFT (20U)
#define ENET_DMA_HW_FEATURE_RXCHCNT_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_RXCHCNT_SHIFT) & ENET_DMA_HW_FEATURE_RXCHCNT_MASK)
#define ENET_DMA_HW_FEATURE_RXCHCNT_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_RXCHCNT_MASK) >> ENET_DMA_HW_FEATURE_RXCHCNT_SHIFT)

/*
 * RXFIFOSIZE (rw)
 *
 * Rx FIFO > 2,048 Bytes
 */
#define ENET_DMA_HW_FEATURE_RXFIFOSIZE_MASK (0x80000UL)
#define ENET_DMA_HW_FEATURE_RXFIFOSIZE_SHIFT (19U)
#define ENET_DMA_HW_FEATURE_RXFIFOSIZE_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_RXFIFOSIZE_SHIFT) & ENET_DMA_HW_FEATURE_RXFIFOSIZE_MASK)
#define ENET_DMA_HW_FEATURE_RXFIFOSIZE_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_RXFIFOSIZE_MASK) >> ENET_DMA_HW_FEATURE_RXFIFOSIZE_SHIFT)

/*
 * RXTYP2COE (rw)
 *
 * IP Checksum Offload (Type 2) in Rx
 */
#define ENET_DMA_HW_FEATURE_RXTYP2COE_MASK (0x40000UL)
#define ENET_DMA_HW_FEATURE_RXTYP2COE_SHIFT (18U)
#define ENET_DMA_HW_FEATURE_RXTYP2COE_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_RXTYP2COE_SHIFT) & ENET_DMA_HW_FEATURE_RXTYP2COE_MASK)
#define ENET_DMA_HW_FEATURE_RXTYP2COE_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_RXTYP2COE_MASK) >> ENET_DMA_HW_FEATURE_RXTYP2COE_SHIFT)

/*
 * RXTYP1COE (rw)
 *
 * IP Checksum Offload (Type 1) in Rx Note: If IPCHKSUM_EN = Enabled and IPC_FULL_OFFLOAD = Enabled, then RXTYP1COE = 0 and RXTYP2COE = 1.
 */
#define ENET_DMA_HW_FEATURE_RXTYP1COE_MASK (0x20000UL)
#define ENET_DMA_HW_FEATURE_RXTYP1COE_SHIFT (17U)
#define ENET_DMA_HW_FEATURE_RXTYP1COE_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_RXTYP1COE_SHIFT) & ENET_DMA_HW_FEATURE_RXTYP1COE_MASK)
#define ENET_DMA_HW_FEATURE_RXTYP1COE_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_RXTYP1COE_MASK) >> ENET_DMA_HW_FEATURE_RXTYP1COE_SHIFT)

/*
 * TXCOESEL (rw)
 *
 * Checksum Offload in Tx
 */
#define ENET_DMA_HW_FEATURE_TXCOESEL_MASK (0x10000UL)
#define ENET_DMA_HW_FEATURE_TXCOESEL_SHIFT (16U)
#define ENET_DMA_HW_FEATURE_TXCOESEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_TXCOESEL_SHIFT) & ENET_DMA_HW_FEATURE_TXCOESEL_MASK)
#define ENET_DMA_HW_FEATURE_TXCOESEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_TXCOESEL_MASK) >> ENET_DMA_HW_FEATURE_TXCOESEL_SHIFT)

/*
 * AVSEL (rw)
 *
 * AV feature
 */
#define ENET_DMA_HW_FEATURE_AVSEL_MASK (0x8000U)
#define ENET_DMA_HW_FEATURE_AVSEL_SHIFT (15U)
#define ENET_DMA_HW_FEATURE_AVSEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_AVSEL_SHIFT) & ENET_DMA_HW_FEATURE_AVSEL_MASK)
#define ENET_DMA_HW_FEATURE_AVSEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_AVSEL_MASK) >> ENET_DMA_HW_FEATURE_AVSEL_SHIFT)

/*
 * EEESEL (rw)
 *
 * Energy Efficient Ethernet
 */
#define ENET_DMA_HW_FEATURE_EEESEL_MASK (0x4000U)
#define ENET_DMA_HW_FEATURE_EEESEL_SHIFT (14U)
#define ENET_DMA_HW_FEATURE_EEESEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_EEESEL_SHIFT) & ENET_DMA_HW_FEATURE_EEESEL_MASK)
#define ENET_DMA_HW_FEATURE_EEESEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_EEESEL_MASK) >> ENET_DMA_HW_FEATURE_EEESEL_SHIFT)

/*
 * TSVER2SEL (rw)
 *
 * IEEE 1588-2008 Advanced timestamp
 */
#define ENET_DMA_HW_FEATURE_TSVER2SEL_MASK (0x2000U)
#define ENET_DMA_HW_FEATURE_TSVER2SEL_SHIFT (13U)
#define ENET_DMA_HW_FEATURE_TSVER2SEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_TSVER2SEL_SHIFT) & ENET_DMA_HW_FEATURE_TSVER2SEL_MASK)
#define ENET_DMA_HW_FEATURE_TSVER2SEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_TSVER2SEL_MASK) >> ENET_DMA_HW_FEATURE_TSVER2SEL_SHIFT)

/*
 * TSVER1SEL (rw)
 *
 * Only IEEE 1588-2002 timestamp
 */
#define ENET_DMA_HW_FEATURE_TSVER1SEL_MASK (0x1000U)
#define ENET_DMA_HW_FEATURE_TSVER1SEL_SHIFT (12U)
#define ENET_DMA_HW_FEATURE_TSVER1SEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_TSVER1SEL_SHIFT) & ENET_DMA_HW_FEATURE_TSVER1SEL_MASK)
#define ENET_DMA_HW_FEATURE_TSVER1SEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_TSVER1SEL_MASK) >> ENET_DMA_HW_FEATURE_TSVER1SEL_SHIFT)

/*
 * MMCSEL (rw)
 *
 * RMON module
 */
#define ENET_DMA_HW_FEATURE_MMCSEL_MASK (0x800U)
#define ENET_DMA_HW_FEATURE_MMCSEL_SHIFT (11U)
#define ENET_DMA_HW_FEATURE_MMCSEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_MMCSEL_SHIFT) & ENET_DMA_HW_FEATURE_MMCSEL_MASK)
#define ENET_DMA_HW_FEATURE_MMCSEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_MMCSEL_MASK) >> ENET_DMA_HW_FEATURE_MMCSEL_SHIFT)

/*
 * MGKSEL (rw)
 *
 * PMT magic packet
 */
#define ENET_DMA_HW_FEATURE_MGKSEL_MASK (0x400U)
#define ENET_DMA_HW_FEATURE_MGKSEL_SHIFT (10U)
#define ENET_DMA_HW_FEATURE_MGKSEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_MGKSEL_SHIFT) & ENET_DMA_HW_FEATURE_MGKSEL_MASK)
#define ENET_DMA_HW_FEATURE_MGKSEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_MGKSEL_MASK) >> ENET_DMA_HW_FEATURE_MGKSEL_SHIFT)

/*
 * RWKSEL (rw)
 *
 * PMT remote wake-up frame
 */
#define ENET_DMA_HW_FEATURE_RWKSEL_MASK (0x200U)
#define ENET_DMA_HW_FEATURE_RWKSEL_SHIFT (9U)
#define ENET_DMA_HW_FEATURE_RWKSEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_RWKSEL_SHIFT) & ENET_DMA_HW_FEATURE_RWKSEL_MASK)
#define ENET_DMA_HW_FEATURE_RWKSEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_RWKSEL_MASK) >> ENET_DMA_HW_FEATURE_RWKSEL_SHIFT)

/*
 * SMASEL (rw)
 *
 * SMA (MDIO) Interface
 */
#define ENET_DMA_HW_FEATURE_SMASEL_MASK (0x100U)
#define ENET_DMA_HW_FEATURE_SMASEL_SHIFT (8U)
#define ENET_DMA_HW_FEATURE_SMASEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_SMASEL_SHIFT) & ENET_DMA_HW_FEATURE_SMASEL_MASK)
#define ENET_DMA_HW_FEATURE_SMASEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_SMASEL_MASK) >> ENET_DMA_HW_FEATURE_SMASEL_SHIFT)

/*
 * L3L4FLTREN (rw)
 *
 * Layer 3 and Layer 4 feature
 */
#define ENET_DMA_HW_FEATURE_L3L4FLTREN_MASK (0x80U)
#define ENET_DMA_HW_FEATURE_L3L4FLTREN_SHIFT (7U)
#define ENET_DMA_HW_FEATURE_L3L4FLTREN_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_L3L4FLTREN_SHIFT) & ENET_DMA_HW_FEATURE_L3L4FLTREN_MASK)
#define ENET_DMA_HW_FEATURE_L3L4FLTREN_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_L3L4FLTREN_MASK) >> ENET_DMA_HW_FEATURE_L3L4FLTREN_SHIFT)

