hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/*
 * PCSSEL (rw)
 *
 * PCS registers (TBI, SGMII, or RTBI PHY interface)
 */
#define ENET_DMA_HW_FEATURE_PCSSEL_MASK (0x40U)
#define ENET_DMA_HW_FEATURE_PCSSEL_SHIFT (6U)
#define ENET_DMA_HW_FEATURE_PCSSEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_PCSSEL_SHIFT) & ENET_DMA_HW_FEATURE_PCSSEL_MASK)
#define ENET_DMA_HW_FEATURE_PCSSEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_PCSSEL_MASK) >> ENET_DMA_HW_FEATURE_PCSSEL_SHIFT)

/*
 * ADDMACADRSEL (rw)
 *
 * Multiple MAC Address registers
 */
#define ENET_DMA_HW_FEATURE_ADDMACADRSEL_MASK (0x20U)
#define ENET_DMA_HW_FEATURE_ADDMACADRSEL_SHIFT (5U)
#define ENET_DMA_HW_FEATURE_ADDMACADRSEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_ADDMACADRSEL_SHIFT) & ENET_DMA_HW_FEATURE_ADDMACADRSEL_MASK)
#define ENET_DMA_HW_FEATURE_ADDMACADRSEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_ADDMACADRSEL_MASK) >> ENET_DMA_HW_FEATURE_ADDMACADRSEL_SHIFT)

/*
 * HASHSEL (rw)
 *
 * HASH filter
 */
#define ENET_DMA_HW_FEATURE_HASHSEL_MASK (0x10U)
#define ENET_DMA_HW_FEATURE_HASHSEL_SHIFT (4U)
#define ENET_DMA_HW_FEATURE_HASHSEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_HASHSEL_SHIFT) & ENET_DMA_HW_FEATURE_HASHSEL_MASK)
#define ENET_DMA_HW_FEATURE_HASHSEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_HASHSEL_MASK) >> ENET_DMA_HW_FEATURE_HASHSEL_SHIFT)

/*
 * EXTHASHEN (rw)
 *
 * Expanded DA Hash filter
 */
#define ENET_DMA_HW_FEATURE_EXTHASHEN_MASK (0x8U)
#define ENET_DMA_HW_FEATURE_EXTHASHEN_SHIFT (3U)
#define ENET_DMA_HW_FEATURE_EXTHASHEN_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_EXTHASHEN_SHIFT) & ENET_DMA_HW_FEATURE_EXTHASHEN_MASK)
#define ENET_DMA_HW_FEATURE_EXTHASHEN_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_EXTHASHEN_MASK) >> ENET_DMA_HW_FEATURE_EXTHASHEN_SHIFT)

/*
 * HDSEL (rw)
 *
 * Half-duplex support
 */
#define ENET_DMA_HW_FEATURE_HDSEL_MASK (0x4U)
#define ENET_DMA_HW_FEATURE_HDSEL_SHIFT (2U)
#define ENET_DMA_HW_FEATURE_HDSEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_HDSEL_SHIFT) & ENET_DMA_HW_FEATURE_HDSEL_MASK)
#define ENET_DMA_HW_FEATURE_HDSEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_HDSEL_MASK) >> ENET_DMA_HW_FEATURE_HDSEL_SHIFT)

/*
 * GMIISEL (rw)
 *
 * 1000 Mbps support
 */
#define ENET_DMA_HW_FEATURE_GMIISEL_MASK (0x2U)
#define ENET_DMA_HW_FEATURE_GMIISEL_SHIFT (1U)
#define ENET_DMA_HW_FEATURE_GMIISEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_GMIISEL_SHIFT) & ENET_DMA_HW_FEATURE_GMIISEL_MASK)
#define ENET_DMA_HW_FEATURE_GMIISEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_GMIISEL_MASK) >> ENET_DMA_HW_FEATURE_GMIISEL_SHIFT)

/*
 * MIISEL (rw)
 *
 * 10 or 100 Mbps support
 */
#define ENET_DMA_HW_FEATURE_MIISEL_MASK (0x1U)
#define ENET_DMA_HW_FEATURE_MIISEL_SHIFT (0U)
#define ENET_DMA_HW_FEATURE_MIISEL_SET(x) (((uint32_t)(x) << ENET_DMA_HW_FEATURE_MIISEL_SHIFT) & ENET_DMA_HW_FEATURE_MIISEL_MASK)
#define ENET_DMA_HW_FEATURE_MIISEL_GET(x) (((uint32_t)(x) & ENET_DMA_HW_FEATURE_MIISEL_MASK) >> ENET_DMA_HW_FEATURE_MIISEL_SHIFT)



/* MAC_ADDR register group index macro definition */
#define ENET_MAC_ADDR_1 (0UL)
#define ENET_MAC_ADDR_2 (1UL)
#define ENET_MAC_ADDR_3 (2UL)
#define ENET_MAC_ADDR_4 (3UL)

/* L3_L4_CFG register group index macro definition */
#define ENET_L3_L4_CFG_0 (0UL)
#define ENET_L3_L4_CFG_1 (1UL)
#define ENET_L3_L4_CFG_2 (2UL)
#define ENET_L3_L4_CFG_3 (3UL)

/* HASH_TABLE register group index macro definition */
#define ENET_HASH_TABLE_REGISTER0 (0UL)
#define ENET_HASH_TABLE_REGISTER1 (1UL)
#define ENET_HASH_TABLE_REGISTER2 (2UL)
#define ENET_HASH_TABLE_REGISTER3 (3UL)
#define ENET_HASH_TABLE_REGISTER4 (4UL)
#define ENET_HASH_TABLE_REGISTER5 (5UL)
#define ENET_HASH_TABLE_REGISTER6 (6UL)
#define ENET_HASH_TABLE_REGISTER7 (7UL)

/* PPS register group index macro definition */
#define ENET_PPS_1 (0UL)
#define ENET_PPS_2 (1UL)
#define ENET_PPS_3 (2UL)


#endif /* HPM_ENET_H */